README.org
#+TITLE: LDBC Benchmarking Ontology
#+DATE: 2015-02-02
#+AUTHOR: Vladimir Alexiev, Ontotext Corp
#+EMAIL: vladimir.alexiev@ontotext.com
#+STARTUP: content
#+OPTIONS: ':nil *:t -:t ::t <:t H:4 \n:nil ^:{} arch:headline author:t c:nil
#+OPTIONS: creator:comment d:(not "LOGBOOK") date:t e:t email:t f:t inline:t num:t
#+OPTIONS: p:nil pri:nil stat:t tags:t tasks:t tex:nil timestamp:t toc:4 todo:t |:t
#+CREATOR: Proudly made with: Emacs 24.3.91.1 (Org mode 8.2.7c)
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto html-preamble:t html-scripts:t
#+LANGUAGE: en

* Intro
The Benchmarking Ontology (BM) will cover the following scope. For each scope area we list some relevant ontologies that we have taken inspiration from, or reused.
- system under test (SUT)
  - hardware & price: GoodRelations, [[http://answers.semanticweb.com/questions/27854/ontology-for-hardware-features][LinkedOpenCommerce]]
  - platform: DOAP, with dbpedia URLs for specific things (eg db:Linux, db:Java_Virtual_Machine)
  - database: DOAP (project and relase), FOAF (vendor, sponsor)
- benchmark definition: RDFUnit, test manifests for DAWG (SPARQL), R2RML, RDF
  - benchmark definition versions
- benchmark execution setup
  - driver, parameters, SUT
- benchmark generator, parameters
  - benchmark dataset (if it makes sense to save rather than rerun generator): VOID
- results provenance: PROV
- detailed results log: RLOG
- results/assertions for each query: EARL, RDFUnit
- result statistics: CUBE, SDMX

This is a rather ambitious scope.
Following partner priorities, we start by describing Result Statistics, which is a little backwards but anyway.

** Revisions
- <2015-01-21>: initial version. Overview of prefixes, potential benchmarks. Stat ontologies, Cube, SPB Sample1, BM Stat initial
- <2015-02-02>: added discussion on Benchmark Result Dimensions [[Benchmark Result Dimensions]]
- NEXT: SPB Stat sample
** Prefixes
All the prefixes we use are in [[./prefixes.ttl]] and should be:
- Added to a repo (eg Ontotext GraphDb can do that from this file), or
- Prepended to Turtle files before loading/validating
We use the prefix.cc service as much as possible. A lot of the used prefixes can be fetched from:
- http://prefix.cc/dbr,dbo,dct,owl,prov,qb,qudt,rdf,rdfs,schema,skos,unit,xsd,sdmx.ttl
We include here a very brief description
| *prefix* | *ontology*                              | *used for*                                          |
| DCT      | Dublin Core Terms                       | various props, eg dct:extent of a Run               |
| DBR      | DBpedia resource                        | stable URLs, eg dbr:Linux, dbr:Java_Virtual_Machine |
| DBO      | DBpedia Ontology                        | (maybe) a few properties                            |
| DOAP     | Description of a Project                | database, release                                   |
| GR       | Good Relations                          | price (or maybe will prefer schema.org)             |
| OWL      | Web Ontology Language                   | system ontology                                     |
| PROV     | Provenance Ontology                     | provenance of results, start/end of Run             |
| QUDT     | Quantities, Units, Dimensions and Types | Units of Measure in stats                           |
| RDF      | Resource Description Framework          | system ontology                                     |
| RDFS     | RDF Schema                              | system ontology                                     |
| Schema   | schema.org ontology                     | various props                                       |
| SKOS     | Simple Knowledge Organisation System    | concepts and codelists (concept schemes)            |
| SPIN     | SPARQL Inferencing Notation             | (maybe) constraints on cube representation          |
| Unit     | Units of Measure (part of QUDT)         | Units of Measure in stats                           |
| XSD      | XML Schema Datatypes                    | literal datatypes                                   |
| SDMX*    | Statistical Data and Metadata eXchange  | statistical concepts                                |
