README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>LDBC Benchmarking Ontology</title>
<!-- 2015-02-02 Mon 15:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Vladimir Alexiev, Ontotext Corp" />

</head>
<body>
<div id="content">
<h1 class="title">LDBC Benchmarking Ontology</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Intro</a>
<ul>
<li><a href="#sec-1-1">1.1. Revisions</a></li>
<li><a href="#sec-1-2">1.2. Prefixes</a></li>
<li><a href="#sec-1-3">1.3. Testing Ontologies</a></li>
<li><a href="#sec-1-4">1.4. Test Manifest</a></li>
<li><a href="#sec-1-5">1.5. EARL</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Potential Benchmarks</a>
<ul>
<li><a href="#sec-2-1">2.1. <span class="todo TODO">TODO</span> SPB</a></li>
<li><a href="#sec-2-2">2.2. <span class="todo TODO">TODO</span> SNB</a></li>
<li><a href="#sec-2-3">2.3. BSBM 3.1</a></li>
<li><a href="#sec-2-4">2.4. LOD2 Cluster</a></li>
<li><a href="#sec-2-5">2.5. StarDog results</a></li>
<li><a href="#sec-2-6">2.6. TPC-H</a></li>
</ul>
</li>
<li><a href="#sec-3">3. BM Statistics</a>
<ul>
<li><a href="#sec-3-1">3.1. Stats Terms</a></li>
<li><a href="#sec-3-2">3.2. Stats Ontologies</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. 270a</a></li>
<li><a href="#sec-3-2-2">3.2.2. Disco</a></li>
<li><a href="#sec-3-2-3">3.2.3. DDI CV, SStat</a>
<ul>
<li><a href="#sec-3-2-3-1">3.2.3.1. Summary Statistics</a></li>
</ul>
</li>
<li><a href="#sec-3-2-4">3.2.4. SDMX</a></li>
<li><a href="#sec-3-2-5">3.2.5. Cube</a></li>
<li><a href="#sec-3-2-6">3.2.6. Cube Normalization</a></li>
<li><a href="#sec-3-2-7">3.2.7. Normalization with Ontotext GraphDb Rules</a></li>
<li><a href="#sec-3-2-8">3.2.8. Benchmark Result Dimensions</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. SNB Sample1</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1. SNB Turtle</a></li>
<li><a href="#sec-3-3-2">3.3.2. SNB Header</a></li>
<li><a href="#sec-3-3-3">3.3.3. SNB SPARQL</a></li>
<li><a href="#sec-3-3-4">3.3.4. SNB Stat Ontology</a></li>
<li><a href="#sec-3-3-5">3.3.5. <span class="todo TODO">TODO</span> SNB FDR</a></li>
</ul>
</li>
<li><a href="#sec-3-4">3.4. SPB Results</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1. <span class="todo TODO">TODO</span> SPB Turtle</a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5. BM Stat Ontology</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Intro</h2>
<div class="outline-text-2" id="text-1">
<p>
The Benchmarking Ontology (BM) will cover the following scope. For each scope area we list some relevant ontologies that we have taken inspiration from, or reused.
</p>
<ul class="org-ul">
<li>system under test (SUT)
<ul class="org-ul">
<li>hardware &amp; price: GoodRelations, <a href="http://answers.semanticweb.com/questions/27854/ontology-for-hardware-features">LinkedOpenCommerce</a>
</li>
<li>platform: DOAP, with dbpedia URLs for specific things (eg db:Linux, db:Java_Virtual_Machine)
</li>
<li>database: DOAP (project and relase), FOAF (vendor, sponsor)
</li>
</ul>
</li>
<li>benchmark definition: RDFUnit, test manifests for DAWG (SPARQL), R2RML, RDF
<ul class="org-ul">
<li>benchmark definition versions
</li>
</ul>
</li>
<li>benchmark execution setup
<ul class="org-ul">
<li>driver, parameters, SUT
</li>
</ul>
</li>
<li>benchmark generator, parameters
<ul class="org-ul">
<li>benchmark dataset (if it makes sense to save rather than rerun generator): VOID
</li>
</ul>
</li>
<li>results provenance: PROV
</li>
<li>detailed results log: RLOG
</li>
<li>results/assertions for each query: EARL, RDFUnit
</li>
<li>result statistics: CUBE, SDMX
</li>
</ul>

<p>
This is a rather ambitious scope.
Following partner priorities, we start by describing Result Statistics, which is a little backwards but anyway.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Revisions</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">&lt;2015-01-21&gt;</span></span>: initial version. Overview of prefixes, potential benchmarks. Stat ontologies, Cube, SPB Sample1, BM Stat initial
</li>
<li><span class="timestamp-wrapper"><span class="timestamp">&lt;2015-02-02&gt;</span></span>: added discussion on Benchmark Result Dimensions <a href="#sec-3-2-8">3.2.8</a>
</li>
<li>NEXT: SPB Stat sample
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Prefixes</h3>
<div class="outline-text-3" id="text-1-2">
<p>
All the prefixes we use are in <a href="./prefixes.ttl">./prefixes.ttl</a> and should be:
</p>
<ul class="org-ul">
<li>Added to a repo (eg Ontotext GraphDb can do that from this file), or
</li>
<li>Prepended to Turtle files before loading/validating
</li>
</ul>
<p>
We use the prefix.cc service as much as possible. A lot of the used prefixes can be fetched from:
</p>
<ul class="org-ul">
<li><a href="http://prefix.cc/dbr,dbo,dct,owl,prov,qb,qudt,rdf,rdfs,schema,skos,unit,xsd,sdmx.ttl">http://prefix.cc/dbr,dbo,dct,owl,prov,qb,qudt,rdf,rdfs,schema,skos,unit,xsd,sdmx.ttl</a>
</li>
</ul>
<p>
We include here a very brief description
</p>
<table border="1" cellspacing="0" cellpadding="0" rules="all" frame="box">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>prefix</b></td>
<td class="left"><b>ontology</b></td>
<td class="left"><b>used for</b></td>
</tr>

<tr>
<td class="left">DCT</td>
<td class="left">Dublin Core Terms</td>
<td class="left">various props, eg dct:extent of a Run</td>
</tr>

<tr>
<td class="left">DBR</td>
<td class="left">DBpedia resource</td>
<td class="left">stable URLs, eg dbr:Linux, dbr:Java_Virtual_Machine</td>
</tr>

<tr>
<td class="left">DBO</td>
<td class="left">DBpedia Ontology</td>
<td class="left">(maybe) a few properties</td>
</tr>

<tr>
<td class="left">DOAP</td>
<td class="left">Description of a Project</td>
<td class="left">database, release</td>
</tr>

<tr>
<td class="left">GR</td>
<td class="left">Good Relations</td>
<td class="left">price (or maybe will prefer schema.org)</td>
</tr>

<tr>
<td class="left">OWL</td>
<td class="left">Web Ontology Language</td>
<td class="left">system ontology</td>
</tr>

<tr>
<td class="left">PROV</td>
<td class="left">Provenance Ontology</td>
<td class="left">provenance of results, start/end of Run</td>
</tr>

<tr>
<td class="left">QUDT</td>
<td class="left">Quantities, Units, Dimensions and Types</td>
<td class="left">Units of Measure in stats</td>
</tr>

<tr>
<td class="left">RDF</td>
<td class="left">Resource Description Framework</td>
<td class="left">system ontology</td>
</tr>

<tr>
<td class="left">RDFS</td>
<td class="left">RDF Schema</td>
<td class="left">system ontology</td>
</tr>

<tr>
<td class="left">Schema</td>
<td class="left">schema.org ontology</td>
<td class="left">various props</td>
</tr>

<tr>
<td class="left">SKOS</td>
<td class="left">Simple Knowledge Organisation System</td>
<td class="left">concepts and codelists (concept schemes)</td>
</tr>

<tr>
<td class="left">SPIN</td>
<td class="left">SPARQL Inferencing Notation</td>
<td class="left">(maybe) constraints on cube representation</td>
</tr>

<tr>
<td class="left">Unit</td>
<td class="left">Units of Measure (part of QUDT)</td>
<td class="left">Units of Measure in stats</td>
</tr>

<tr>
<td class="left">XSD</td>
<td class="left">XML Schema Datatypes</td>
<td class="left">literal datatypes</td>
</tr>

<tr>
<td class="left">SDMX*</td>
<td class="left">Statistical Data and Metadata eXchange</td>
<td class="left">statistical concepts</td>
</tr>
</tbody>
</table>
</div>
</div>
