README.org
** Testing Ontologies
The idea to represent tests and test runs in RDF is very old.
We've studied a number of testing ontologies that have influenced greatly our design.
Still, we couldn't reuse a lot, because our domain is performance testing, not conformance testing.

Below are some brief descriptions, followed by more details in subsections. Legend:
- x = well developed or widely used
- ? = maybe will use
- + = will use
| *s* | *prefix*      | *ontology*                            | *could be used for*                              |
| x   | EARL          | Evaluation and Report Language        | reporting conformance (pass/fail) claims         |
|     | NIF-STC       | NIF test case                         | weak ontology for testing NLP Interchange Format |
| x   | RDB2RDF-TC    | RDB2RDF test case                     | testing RDB2RDF mapping language implementations |
|     | RDB2RDF-test  | RDB2RDF test                          | testing RDB2RDF. Missing                         |
|     | RDF-test      | RDF 1.1 test                          | testing RDF parsers                              |
|     | RDF-test1     | RDF test (old)                        | testing RDF parsers                              |
| ?   | result-set    | SPARQL result set                     | could be used in conformance/validation testing  |
| +   | RLOG          | RDF Logging Ontology                  | basic log entry (timestamp, level, message)      |
| x   | RUT*          | RDFUnit: test generation and excution | test definitions and test results                |
|     | test-dawg     | SPARQL query testing (old)            |                                                  |
| ?   | test-descr    | Test Metadata, see [[http://www.w3.org/TR/test-metadata/][working note]]       | Purpose, grouping, etc                           |
| +   | test-manifest | Test Manifest                         | representing test cases                          |
| x   | test-query    | SPARQL 1.1 query testing              |                                                  |
|     | test-update   | SPARQL 1.1 update testing             |                                                  |
** Test Manifest
A test Manifest is a ttl description of a test suite (set of test cases), pointing to all relevant files (inputs, queries, "action" or expected output).
Manifests are widely used by W3C working groups.
Because test cases are made up mostly of files, it is notorious how well the directory and RDF structures are inter-meshed, and we should learn from this.
Test cases and queries have stable identifiers, which are used as pivots in test reporting (see EARL).

Examples:
- RDF 1.1 ::
  - A number of tests for the various RDF serialization formats http://www.w3.org/TR/rdf11-testcases/. Eg for Turtle 1.1:
  - tests http://www.w3.org/2013/TurtleTests/
  - manifest http://www.w3.org/2013/TurtleTests/manifest.ttl
  - methodology: http://www.w3.org/2013/TurtleTests/README, http://www.w3.org/2011/rdf-wg/wiki/Turtle_Test_Suite
- SPARQL/DAWG/SparqlScore ::
  - old tests: http://www.w3.org/2001/sw/DataAccess/, http://www.w3.org/2001/sw/DataAccess/data-r2
  - new test: http://www.w3.org/2009/sparql/docs/tests
- R2RML ::
  - Methodology: http://www.w3.org/2001/sw/rdb2rdf/wiki/Submitting_Test_Results
  - Test cases: http://www.w3.org/TR/rdb2rdf-test-cases/
  - Test files & manifests: https://dvcs.w3.org/hg/rdb2rdf-tests/file/
  - Ontology http://vocab.deri.ie/rdb2rdftc.html, http://vocab.deri.ie/rdb2rdftc.ttl.
    Carries input (database statements), R2RML mapping, expected output.
    - This one is missing: http://purl.org/NET/rdb2rdf-test
    - This one has various problems: https://github.com/boricles/rdb2rdf-th/blob/master/model/rdb2rdf-test.ttl,
      eg some ObjectProperties are duplicated as AnnotationProperties
  - Numerous manifests. Eg for two Test Cases:
    - https://dvcs.w3.org/hg/rdb2rdf-tests/raw-file/d53b6a1cc393/D025-3tables3primarykeys3foreignkeys/manifest.ttl
    - https://dvcs.w3.org/hg/rdb2rdf-tests/raw-file/d53b6a1cc393/D011-M2MRelations/manifest.ttl
