README.html
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Testing Ontologies</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The idea to represent tests and test runs in RDF is very old.
We've studied a number of testing ontologies that have influenced greatly our design.
Still, we couldn't reuse a lot, because our domain is performance testing, not conformance testing.
</p>

<p>
Below are some brief descriptions, followed by more details in subsections. Legend:
</p>
<ul class="org-ul">
<li>x = well developed or widely used
</li>
<li>? = maybe will use
</li>
<li>+ = will use
</li>
</ul>
<table border="1" cellspacing="0" cellpadding="0" rules="all" frame="box">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>s</b></td>
<td class="left"><b>prefix</b></td>
<td class="left"><b>ontology</b></td>
<td class="left"><b>could be used for</b></td>
</tr>

<tr>
<td class="left">x</td>
<td class="left">EARL</td>
<td class="left">Evaluation and Report Language</td>
<td class="left">reporting conformance (pass/fail) claims</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">NIF-STC</td>
<td class="left">NIF test case</td>
<td class="left">weak ontology for testing NLP Interchange Format</td>
</tr>

<tr>
<td class="left">x</td>
<td class="left">RDB2RDF-TC</td>
<td class="left">RDB2RDF test case</td>
<td class="left">testing RDB2RDF mapping language implementations</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">RDB2RDF-test</td>
<td class="left">RDB2RDF test</td>
<td class="left">testing RDB2RDF. Missing</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">RDF-test</td>
<td class="left">RDF 1.1 test</td>
<td class="left">testing RDF parsers</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">RDF-test1</td>
<td class="left">RDF test (old)</td>
<td class="left">testing RDF parsers</td>
</tr>

<tr>
<td class="left">?</td>
<td class="left">result-set</td>
<td class="left">SPARQL result set</td>
<td class="left">could be used in conformance/validation testing</td>
</tr>

<tr>
<td class="left">+</td>
<td class="left">RLOG</td>
<td class="left">RDF Logging Ontology</td>
<td class="left">basic log entry (timestamp, level, message)</td>
</tr>

<tr>
<td class="left">x</td>
<td class="left">RUT*</td>
<td class="left">RDFUnit: test generation and excution</td>
<td class="left">test definitions and test results</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">test-dawg</td>
<td class="left">SPARQL query testing (old)</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">?</td>
<td class="left">test-descr</td>
<td class="left">Test Metadata, see <a href="http://www.w3.org/TR/test-metadata/">working note</a></td>
<td class="left">Purpose, grouping, etc</td>
</tr>

<tr>
<td class="left">+</td>
<td class="left">test-manifest</td>
<td class="left">Test Manifest</td>
<td class="left">representing test cases</td>
</tr>

<tr>
<td class="left">x</td>
<td class="left">test-query</td>
<td class="left">SPARQL 1.1 query testing</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">test-update</td>
<td class="left">SPARQL 1.1 update testing</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Test Manifest</h3>
<div class="outline-text-3" id="text-1-4">
<p>
A test Manifest is a ttl description of a test suite (set of test cases), pointing to all relevant files (inputs, queries, "action" or expected output).
Manifests are widely used by W3C working groups.
Because test cases are made up mostly of files, it is notorious how well the directory and RDF structures are inter-meshed, and we should learn from this.
Test cases and queries have stable identifiers, which are used as pivots in test reporting (see EARL).
</p>

<p>
Examples:
</p>
<dl class="org-dl">
<dt> RDF 1.1 </dt><dd><ul class="org-ul">
<li>A number of tests for the various RDF serialization formats <a href="http://www.w3.org/TR/rdf11-testcases/">http://www.w3.org/TR/rdf11-testcases/</a>. Eg for Turtle 1.1:
</li>
<li>tests <a href="http://www.w3.org/2013/TurtleTests/">http://www.w3.org/2013/TurtleTests/</a>
</li>
<li>manifest <a href="http://www.w3.org/2013/TurtleTests/manifest.ttl">http://www.w3.org/2013/TurtleTests/manifest.ttl</a>
</li>
<li>methodology: <a href="http://www.w3.org/2013/TurtleTests/README">http://www.w3.org/2013/TurtleTests/README</a>, <a href="http://www.w3.org/2011/rdf-wg/wiki/Turtle_Test_Suite">http://www.w3.org/2011/rdf-wg/wiki/Turtle_Test_Suite</a>
</li>
</ul>
</dd>
<dt> SPARQL/DAWG/SparqlScore </dt><dd><ul class="org-ul">
<li>old tests: <a href="http://www.w3.org/2001/sw/DataAccess/">http://www.w3.org/2001/sw/DataAccess/</a>, <a href="http://www.w3.org/2001/sw/DataAccess/data-r2">http://www.w3.org/2001/sw/DataAccess/data-r2</a>
</li>
<li>new test: <a href="http://www.w3.org/2009/sparql/docs/tests">http://www.w3.org/2009/sparql/docs/tests</a>
</li>
</ul>
</dd>
<dt> R2RML </dt><dd><ul class="org-ul">
<li>Methodology: <a href="http://www.w3.org/2001/sw/rdb2rdf/wiki/Submitting_Test_Results">http://www.w3.org/2001/sw/rdb2rdf/wiki/Submitting_Test_Results</a>
</li>
<li>Test cases: <a href="http://www.w3.org/TR/rdb2rdf-test-cases/">http://www.w3.org/TR/rdb2rdf-test-cases/</a>
</li>
<li>Test files &amp; manifests: <a href="https://dvcs.w3.org/hg/rdb2rdf-tests/file/">https://dvcs.w3.org/hg/rdb2rdf-tests/file/</a>
</li>
<li>Ontology <a href="http://vocab.deri.ie/rdb2rdftc.html">http://vocab.deri.ie/rdb2rdftc.html</a>, <a href="http://vocab.deri.ie/rdb2rdftc.ttl">http://vocab.deri.ie/rdb2rdftc.ttl</a>.
Carries input (database statements), R2RML mapping, expected output.
<ul class="org-ul">
<li>This one is missing: <a href="http://purl.org/NET/rdb2rdf-test">http://purl.org/NET/rdb2rdf-test</a>
</li>
<li>This one has various problems: <a href="https://github.com/boricles/rdb2rdf-th/blob/master/model/rdb2rdf-test.ttl">https://github.com/boricles/rdb2rdf-th/blob/master/model/rdb2rdf-test.ttl</a>,
eg some ObjectProperties are duplicated as AnnotationProperties
</li>
</ul>
</li>
<li>Numerous manifests. Eg for two Test Cases:
<ul class="org-ul">
<li><a href="https://dvcs.w3.org/hg/rdb2rdf-tests/raw-file/d53b6a1cc393/D025-3tables3primarykeys3foreignkeys/manifest.ttl">https://dvcs.w3.org/hg/rdb2rdf-tests/raw-file/d53b6a1cc393/D025-3tables3primarykeys3foreignkeys/manifest.ttl</a>
</li>
<li><a href="https://dvcs.w3.org/hg/rdb2rdf-tests/raw-file/d53b6a1cc393/D011-M2MRelations/manifest.ttl">https://dvcs.w3.org/hg/rdb2rdf-tests/raw-file/d53b6a1cc393/D011-M2MRelations/manifest.ttl</a>
</li>
</ul>
</li>
</ul>
</dd>
</dl>
</div>
</div>
