README.org
** EARL
EARL (Evaluation and Report Language) was first developed by the WAI Evaluation and Repair Tools Working Group, but is now used widely by W3C groups.
- Intro: http://www.w3.org/WAI/intro/earl.php
- Requirements: http://www.w3.org/TR/EARL10-Requirements/
- Guide: http://www.w3.org/TR/EARL10-Guide/
- Definition: http://www.w3.org/TR/EARL10-Schema/
Most W3C specifications have an obligation to produce an Implementation Report that list at least 2 conformant implementations for every spec feature.
This requires conformance testing, and EARL  is designed to express conformance claims.
By asking implementors to provide results in EARL, the implementation reports of numerous systems can be assembled automatically to a webpage.
We want to use the same idea for the benchmark reporting section of the LDBC website.

Examples:
- RDF 1.1 ::
  - Includes a number of implementation reports for varous RDF serialization formats. Eg for Turtle 1.1:
  - Implementation report: https://dvcs.w3.org/hg/rdf/raw-file/default/rdf-turtle/reports/earl.ttl
  - Report in EARL: https://dvcs.w3.org/hg/rdf/raw-file/default/rdf-turtle/reports/index.html
  - Individual EARL files: https://dvcs.w3.org/hg/rdf/raw-file/default/rdf-turtle/reports/index.html#individual-test-results
- RDB2RDF ::
  - Implementation report: http://www.w3.org/TR/rdb2rdf-implementations/
  - EARL files are linked to the column headers, eg:
    - Virtuoso: http://mappingpedia.linkeddata.es/rdb2rdf/implementations/virtuoso/Rdb2RdfW3c1206_virtuoso_earl.ttl
    - RDB2RDF over Postgres: http://mappingpedia.linkeddata.es/rdb2rdf/implementations/rdf-rdb2rdf/with-postgres.ttl
  - I have looked at the Perl implementation in more detail:
    - Report with more detailed explanations of each result: https://github.com/tobyink/p5-rdf-rdb2rdf/blob/master/meta/earl/summary.html
    - EARL files: https://github.com/tobyink/p5-rdf-rdb2rdf/tree/master/meta/earl
- SPARQL ::
  - Implementation report http://www.w3.org/2009/sparql/implementations/
  - EARL files are linked at the end, eg
    - Jena ARQ: http://people.apache.org/~andy/SPARQL-EARL-Current/ARQ-earl-2012-11-27.ttl
    - ARQ with entailment (inference): http://arq-inference.googlecode.com/svn/ARQ_Inference/ARQ_Entailment_ImplRep.ttl
  - EARL files (old): http://www.w3.org/2001/sw/DataAccess/tests/earl

Report makers (HTML generators):
- Report for RDF: https://github.com/gkellogg/earl-report
- Report for SPARQL: https://github.com/kasei/SPARQL-1.1-Implementation-Report
- Report for RDB2RDF Perl: https://github.com/tobyink/p5-rdf-rdb2rdf/blob/master/devel.utils/earl-summaries.pl

Test drivers (harness & EARL generators):
- RDB2RDF
  - Source: https://github.com/boricles/rdb2rdf-th
  - Binary: http://boris.villazon.terrazas.name/projects/rdb2rdf/tc/th/rdb2rdf-th_bin_0.0.8.zip
  - Description: http://www.w3.org/2001/sw/rdb2rdf/wiki/Submitting_Test_Results#Phase_3._Download_the_Test_Harness_software
- RDB2RDF Perl: https://github.com/tobyink/p5-rdf-rdb2rdf/tree/master/xt, in particular https://github.com/tobyink/p5-rdf-rdb2rdf/tree/master/xt/lib/Test/RDB2RDF/Suite.pm
- EARL manipulation: https://metacpan.org/source/GWILLIAMS/RDF-EARL-0.001/README

* Potential Benchmarks
We follow an example-driven appproach: first make Turtle files for specific examples, then make an ontology to fit them.
(Since we borrow liberally from other ontologies, in many cases we make what's called Application Profiles,
i.e. specifications about the shapes of our RDF.)

We may cover the following examples, listed in decreasing priority. Our intent is for BM to be able to represent all of these benchmarks
| *Abbrev* | *Benchmark*                      | *MoSCoW* |
| SPB      | Semantic Publishing Benchmark    | must     |
| SNB      | Social Network Benchmark         | must     |
| BSBM     | Berlin SPARQL Benchmark          | should   |
| SP2B     | SPARQL 2 Benchmark               | could    |
| LUBM     | LUBM Lehigh University Benchmark | could    |
| TPC-H    | Transaction Processing Council H | won't    |
** TODO SPB
Update description & links
- SPB Spec https://github.com/ldbc/ldbc_spb_bm/blob/master/doc/LDBC_SPB_v0.1.pdf
- SPB FDR https://github.com/ldbc/ldbc_spb_bm/blob/master/doc/LDBC_SPB_FDR_v1.0.docx
- latest description
- a dataset, with its description
- sample test run results
** TODO SNB
Update description & links
- latest description. SPB presents an interesting challenge, in that the queries have several representations (English, SPARQL, CYPHER)
- a dataset, with its description
- sample test run results. Would be best if you have from two different systems
- SNB spec https://github.com/ldbc/ldbc_snb_docs/blob/master/LDBC_SNB_v0.1.5.pdf
- SNB Interactive Workload design doc (http://ldbc.eu/sites/default/files/LDBC_D3.3.34.pdf)
- SNB Full Disclosure: full_disclosure.txt and supporting_files/
- SNB interactive workload mix (first section of http://ldbc.eu/sites/default/files/LDBC_D2.2.3_final.pdf)
