README.html
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> EARL</h3>
<div class="outline-text-3" id="text-1-5">
<p>
EARL (Evaluation and Report Language) was first developed by the WAI Evaluation and Repair Tools Working Group, but is now used widely by W3C groups.
</p>
<ul class="org-ul">
<li>Intro: <a href="http://www.w3.org/WAI/intro/earl.php">http://www.w3.org/WAI/intro/earl.php</a>
</li>
<li>Requirements: <a href="http://www.w3.org/TR/EARL10-Requirements/">http://www.w3.org/TR/EARL10-Requirements/</a>
</li>
<li>Guide: <a href="http://www.w3.org/TR/EARL10-Guide/">http://www.w3.org/TR/EARL10-Guide/</a>
</li>
<li>Definition: <a href="http://www.w3.org/TR/EARL10-Schema/">http://www.w3.org/TR/EARL10-Schema/</a>
</li>
</ul>
<p>
Most W3C specifications have an obligation to produce an Implementation Report that list at least 2 conformant implementations for every spec feature.
This requires conformance testing, and EARL  is designed to express conformance claims.
By asking implementors to provide results in EARL, the implementation reports of numerous systems can be assembled automatically to a webpage.
We want to use the same idea for the benchmark reporting section of the LDBC website.
</p>

<p>
Examples:
</p>
<dl class="org-dl">
<dt> RDF 1.1 </dt><dd><ul class="org-ul">
<li>Includes a number of implementation reports for varous RDF serialization formats. Eg for Turtle 1.1:
</li>
<li>Implementation report: <a href="https://dvcs.w3.org/hg/rdf/raw-file/default/rdf-turtle/reports/earl.ttl">https://dvcs.w3.org/hg/rdf/raw-file/default/rdf-turtle/reports/earl.ttl</a>
</li>
<li>Report in EARL: <a href="https://dvcs.w3.org/hg/rdf/raw-file/default/rdf-turtle/reports/index.html">https://dvcs.w3.org/hg/rdf/raw-file/default/rdf-turtle/reports/index.html</a>
</li>
<li>Individual EARL files: <a href="https://dvcs.w3.org/hg/rdf/raw-file/default/rdf-turtle/reports/index.html#individual-test-results">https://dvcs.w3.org/hg/rdf/raw-file/default/rdf-turtle/reports/index.html#individual-test-results</a>
</li>
</ul>
</dd>
<dt> RDB2RDF </dt><dd><ul class="org-ul">
<li>Implementation report: <a href="http://www.w3.org/TR/rdb2rdf-implementations/">http://www.w3.org/TR/rdb2rdf-implementations/</a>
</li>
<li>EARL files are linked to the column headers, eg:
<ul class="org-ul">
<li>Virtuoso: <a href="http://mappingpedia.linkeddata.es/rdb2rdf/implementations/virtuoso/Rdb2RdfW3c1206_virtuoso_earl.ttl">http://mappingpedia.linkeddata.es/rdb2rdf/implementations/virtuoso/Rdb2RdfW3c1206_virtuoso_earl.ttl</a>
</li>
<li>RDB2RDF over Postgres: <a href="http://mappingpedia.linkeddata.es/rdb2rdf/implementations/rdf-rdb2rdf/with-postgres.ttl">http://mappingpedia.linkeddata.es/rdb2rdf/implementations/rdf-rdb2rdf/with-postgres.ttl</a>
</li>
</ul>
</li>
<li>I have looked at the Perl implementation in more detail:
<ul class="org-ul">
<li>Report with more detailed explanations of each result: <a href="https://github.com/tobyink/p5-rdf-rdb2rdf/blob/master/meta/earl/summary.html">https://github.com/tobyink/p5-rdf-rdb2rdf/blob/master/meta/earl/summary.html</a>
</li>
<li>EARL files: <a href="https://github.com/tobyink/p5-rdf-rdb2rdf/tree/master/meta/earl">https://github.com/tobyink/p5-rdf-rdb2rdf/tree/master/meta/earl</a>
</li>
</ul>
</li>
</ul>
</dd>
<dt> SPARQL </dt><dd><ul class="org-ul">
<li>Implementation report <a href="http://www.w3.org/2009/sparql/implementations/">http://www.w3.org/2009/sparql/implementations/</a>
</li>
<li>EARL files are linked at the end, eg
<ul class="org-ul">
<li>Jena ARQ: <a href="http://people.apache.org/~andy/SPARQL-EARL-Current/ARQ-earl-2012-11-27.ttl">http://people.apache.org/~andy/SPARQL-EARL-Current/ARQ-earl-2012-11-27.ttl</a>
</li>
<li>ARQ with entailment (inference): <a href="http://arq-inference.googlecode.com/svn/ARQ_Inference/ARQ_Entailment_ImplRep.ttl">http://arq-inference.googlecode.com/svn/ARQ_Inference/ARQ_Entailment_ImplRep.ttl</a>
</li>
</ul>
</li>
<li>EARL files (old): <a href="http://www.w3.org/2001/sw/DataAccess/tests/earl">http://www.w3.org/2001/sw/DataAccess/tests/earl</a>
</li>
</ul>
</dd>
</dl>

<p>
Report makers (HTML generators):
</p>
<ul class="org-ul">
<li>Report for RDF: <a href="https://github.com/gkellogg/earl-report">https://github.com/gkellogg/earl-report</a>
</li>
<li>Report for SPARQL: <a href="https://github.com/kasei/SPARQL-1.1-Implementation-Report">https://github.com/kasei/SPARQL-1.1-Implementation-Report</a>
</li>
<li>Report for RDB2RDF Perl: <a href="https://github.com/tobyink/p5-rdf-rdb2rdf/blob/master/devel.utils/earl-summaries.pl">https://github.com/tobyink/p5-rdf-rdb2rdf/blob/master/devel.utils/earl-summaries.pl</a>
</li>
</ul>

<p>
Test drivers (harness &amp; EARL generators):
</p>
<ul class="org-ul">
<li>RDB2RDF
<ul class="org-ul">
<li>Source: <a href="https://github.com/boricles/rdb2rdf-th">https://github.com/boricles/rdb2rdf-th</a>
</li>
<li>Binary: <a href="http://boris.villazon.terrazas.name/projects/rdb2rdf/tc/th/rdb2rdf-th_bin_0.0.8.zip">http://boris.villazon.terrazas.name/projects/rdb2rdf/tc/th/rdb2rdf-th_bin_0.0.8.zip</a>
</li>
<li>Description: <a href="http://www.w3.org/2001/sw/rdb2rdf/wiki/Submitting_Test_Results#Phase_3._Download_the_Test_Harness_software">http://www.w3.org/2001/sw/rdb2rdf/wiki/Submitting_Test_Results#Phase_3._Download_the_Test_Harness_software</a>
</li>
</ul>
</li>
<li>RDB2RDF Perl: <a href="https://github.com/tobyink/p5-rdf-rdb2rdf/tree/master/xt">https://github.com/tobyink/p5-rdf-rdb2rdf/tree/master/xt</a>, in particular <a href="https://github.com/tobyink/p5-rdf-rdb2rdf/tree/master/xt/lib/Test/RDB2RDF/Suite.pm">https://github.com/tobyink/p5-rdf-rdb2rdf/tree/master/xt/lib/Test/RDB2RDF/Suite.pm</a>
</li>
<li>EARL manipulation: <a href="https://metacpan.org/source/GWILLIAMS/RDF-EARL-0.001/README">https://metacpan.org/source/GWILLIAMS/RDF-EARL-0.001/README</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Potential Benchmarks</h2>
<div class="outline-text-2" id="text-2">
<p>
We follow an example-driven appproach: first make Turtle files for specific examples, then make an ontology to fit them.
(Since we borrow liberally from other ontologies, in many cases we make what's called Application Profiles,
i.e. specifications about the shapes of our RDF.)
</p>

<p>
We may cover the following examples, listed in decreasing priority. Our intent is for BM to be able to represent all of these benchmarks
</p>
<table border="1" cellspacing="0" cellpadding="0" rules="all" frame="box">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>Abbrev</b></td>
<td class="left"><b>Benchmark</b></td>
<td class="left"><b>MoSCoW</b></td>
</tr>

<tr>
<td class="left">SPB</td>
<td class="left">Semantic Publishing Benchmark</td>
<td class="left">must</td>
</tr>

<tr>
<td class="left">SNB</td>
<td class="left">Social Network Benchmark</td>
<td class="left">must</td>
</tr>

<tr>
<td class="left">BSBM</td>
<td class="left">Berlin SPARQL Benchmark</td>
<td class="left">should</td>
</tr>

<tr>
<td class="left">SP2B</td>
<td class="left">SPARQL 2 Benchmark</td>
<td class="left">could</td>
</tr>

<tr>
<td class="left">LUBM</td>
<td class="left">LUBM Lehigh University Benchmark</td>
<td class="left">could</td>
</tr>

<tr>
<td class="left">TPC-H</td>
<td class="left">Transaction Processing Council H</td>
<td class="left">won't</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> SPB</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Update description &amp; links
</p>
<ul class="org-ul">
<li>SPB Spec <a href="https://github.com/ldbc/ldbc_spb_bm/blob/master/doc/LDBC_SPB_v0.1.pdf">https://github.com/ldbc/ldbc_spb_bm/blob/master/doc/LDBC_SPB_v0.1.pdf</a>
</li>
<li>SPB FDR <a href="https://github.com/ldbc/ldbc_spb_bm/blob/master/doc/LDBC_SPB_FDR_v1.0.docx">https://github.com/ldbc/ldbc_spb_bm/blob/master/doc/LDBC_SPB_FDR_v1.0.docx</a>
</li>
<li>latest description
</li>
<li>a dataset, with its description
</li>
<li>sample test run results
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> SNB</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Update description &amp; links
</p>
<ul class="org-ul">
<li>latest description. SPB presents an interesting challenge, in that the queries have several representations (English, SPARQL, CYPHER)
</li>
<li>a dataset, with its description
</li>
<li>sample test run results. Would be best if you have from two different systems
</li>
<li>SNB spec <a href="https://github.com/ldbc/ldbc_snb_docs/blob/master/LDBC_SNB_v0.1.5.pdf">https://github.com/ldbc/ldbc_snb_docs/blob/master/LDBC_SNB_v0.1.5.pdf</a>
</li>
<li>SNB Interactive Workload design doc (<a href="http://ldbc.eu/sites/default/files/LDBC_D3.3.34.pdf">http://ldbc.eu/sites/default/files/LDBC_D3.3.34.pdf</a>)
</li>
<li>SNB Full Disclosure: full_disclosure.txt and supporting_files/
</li>
<li>SNB interactive workload mix (first section of <a href="http://ldbc.eu/sites/default/files/LDBC_D2.2.3_final.pdf">http://ldbc.eu/sites/default/files/LDBC_D2.2.3_final.pdf</a>)
</li>
</ul>
</div>
</div>
