README.org
** BSBM 3.1
- spec 3.1: http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/spec/index.html
- data generator: http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/spec/BenchmarkRules/index.html#datagenerator
- run Apr 2013: http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/results/V7/index.html
- driver
  - BSBM release 0.2: http://sourceforge.net/projects/bsbmtools/files/bsbmtools/bsbmtools-0.2/bsbmtools-v0.2.zip.
    It seems this one is obsoleted by the next one
  - BSBM+BI release 0.7.8: http://sourceforge.net/projects/bibm/files/bibm-0.7.8.tgz
- Queries
  - query format: http://sourceforge.net/p/bibm/code/HEAD/tree/trunk/bibm/docs/OpenLinkBDSMUserGuide.html
  - query files: http://sourceforge.net/p/bibm/code/HEAD/tree/trunk/bibm/bsbm/
  - queries on page: http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/V3/spec/ExploreUseCase/index.html#queryTripleQ1
- Virtuoso and OWLIM results on a couple of scaleFactors for:
  - Explore Use Case: http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/results/V7/index.html#resultsExplore
  - BI use case: http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/results/V7/index.html#resultsBI
- Cluster
  - Cluster description (but it's not very detailed)
  - Cluster results: http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/results/V7/index.html#resultsCluster
** LOD2 Cluster
Description of sophisticated hardware:
- http://static.lod2.eu/Deliverables/LOD2_D2.1.3_LOD_Cloud_Hosted_On_The_LOD2_Knowledge_Store_Cluster_50B_Triples.pdf
** StarDog results
Succinct sheet describing results for BSBM, LUBM, SP2B:
- https://docs.google.com/spreadsheets/d/1oHSWX_0ChZ61ofipZ1CMsW7OhyujioR28AfHzU9d56k/pubhtml
Nice variety but little detail
** TPC-H
- http://www.tpc.org/tpch/results/tpch_price_perf_results.asp
Tons of detial, maybe not so relevant for us. Each run has representations at these levels of detail:
- One line
  : Rank, Company, System, QphH, Price/QphH, Watts/KQphH, System Availability, Database, Operating System, Date Submitted, Cluster
- Executive Summary: eg 13 pages
- Full Disclosure Report: eg 37 pages
- Supporting Files: 6Mb to 3Gb(!): won't look at them
Results:
- TPC-H Oracle:
  [[http://www.tpc.org/tpch/results/tpch_result_detail.asp?id=111092601&layout=]]
- TPC-H Huawei:
  [[http://www.tpc.org/tpch/results/tpch_result_detail.asp?id=113111601&layout=]]

* BM Statistics
The most important output of BM is the statistical representation of benchmark results.
** Stats Terms
It may be hard for someone without stats background to understand stats ontologies, so we provide first some terms from stats/OLAP.
Pleae note that these terms are slanted towards teh Cube ontology.
The key terms are Dimension, Attribute, Measure.
- Cube: a multidimensional data structure carrying Observations
- Observation: a value plus a number of Components that help make sense of it
- Component: any of Dimension, Attribute or Measure; the facets defining the structure of a cube
- Data Structure Definition: the set of components defining a cube.
- Dimension: identifies the observations: where the observations lie
  - In a cube, all observations must have the same dimensions (no nulls are allowed), but some shortcuts/normalization are allowed
- Attribute: qualify and interpret the value, eg: unit of measurement, estimated, provisional
- Measure: carries the observed value: what the values are
- measureType Dimension: a Dimension defining which Measure is applicable to an Observation (like a tag/discriminator in a [[https://en.wikipedia.org/wiki/Tagged_union][Tagged Union]])
- Slice: a cube subset where some of the Dimensions are fixed. Allows more economical cube description, and views over cubes (eg time series)
** Stats Ontologies
We've looked at a number of stats ontologies, described in subsections below (the ones we use are described last). Legend:
- x = well developed or widely used
- ? = maybe will use
- + = will use
| *s* | *prefix* | *ontology*                                                                            | *could be used for*                                     |
|     | Disco    | DDI RDF Discovery Vocabulary (Data Documentation Initiative)                          | Detailed representation of stats, questions, cases..    |
| +   | QB       | RDF Data Cube Vocabulary                                                              | "Canonical" stats ontology (SCOVO is the older version) |
| ?   | QB4OLAP  | Cube for OLAP, see [[https://books.google.bg/books?id%3DC7x_BAAAQBAJ&lpg%3DPA554&ots%3DWohdQ_jPkk&dq%3Dqb%253AcomponentAttachment&pg%3DPA558#v%3Donepage&q&f%3Dtrue][Data Warehouse Systems: Design and Implementation]] sec 14.3.2 p.557 | Cube can't represent hierarchical dimensions            |
| +   | SDMX     | Statistical Data and Metadata eXchange                                                | common stat concepts, attributes, dimensions            |
| ?   | SStat    | DDI Controlled Vocabularies - SummaryStatistic                                        | Concepts for summary stats (min, max, mean...)          |
|     | XKOS     | Extended Knowledge Organisation System                                                | SKOS extension with statistical levels                  |
