README.html
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> BSBM 3.1</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>spec 3.1: <a href="http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/spec/index.html">http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/spec/index.html</a>
</li>
<li>data generator: <a href="http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/spec/BenchmarkRules/index.html#datagenerator">http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/spec/BenchmarkRules/index.html#datagenerator</a>
</li>
<li>run Apr 2013: <a href="http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/results/V7/index.html">http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/results/V7/index.html</a>
</li>
<li>driver
<ul class="org-ul">
<li>BSBM release 0.2: <a href="http://sourceforge.net/projects/bsbmtools/files/bsbmtools/bsbmtools-0.2/bsbmtools-v0.2.zip">http://sourceforge.net/projects/bsbmtools/files/bsbmtools/bsbmtools-0.2/bsbmtools-v0.2.zip</a>.
It seems this one is obsoleted by the next one
</li>
<li>BSBM+BI release 0.7.8: <a href="http://sourceforge.net/projects/bibm/files/bibm-0.7.8.tgz">http://sourceforge.net/projects/bibm/files/bibm-0.7.8.tgz</a>
</li>
</ul>
</li>
<li>Queries
<ul class="org-ul">
<li>query format: <a href="http://sourceforge.net/p/bibm/code/HEAD/tree/trunk/bibm/docs/OpenLinkBDSMUserGuide.html">http://sourceforge.net/p/bibm/code/HEAD/tree/trunk/bibm/docs/OpenLinkBDSMUserGuide.html</a>
</li>
<li>query files: <a href="http://sourceforge.net/p/bibm/code/HEAD/tree/trunk/bibm/bsbm/">http://sourceforge.net/p/bibm/code/HEAD/tree/trunk/bibm/bsbm/</a>
</li>
<li>queries on page: <a href="http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/V3/spec/ExploreUseCase/index.html#queryTripleQ1">http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/V3/spec/ExploreUseCase/index.html#queryTripleQ1</a>
</li>
</ul>
</li>
<li>Virtuoso and OWLIM results on a couple of scaleFactors for:
<ul class="org-ul">
<li>Explore Use Case: <a href="http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/results/V7/index.html#resultsExplore">http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/results/V7/index.html#resultsExplore</a>
</li>
<li>BI use case: <a href="http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/results/V7/index.html#resultsBI">http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/results/V7/index.html#resultsBI</a>
</li>
</ul>
</li>
<li>Cluster
<ul class="org-ul">
<li>Cluster description (but it's not very detailed)
</li>
<li>Cluster results: <a href="http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/results/V7/index.html#resultsCluster">http://wifo5-03.informatik.uni-mannheim.de/bizer/berlinsparqlbenchmark/results/V7/index.html#resultsCluster</a>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> LOD2 Cluster</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Description of sophisticated hardware:
</p>
<ul class="org-ul">
<li><a href="http://static.lod2.eu/Deliverables/LOD2_D2.1.3_LOD_Cloud_Hosted_On_The_LOD2_Knowledge_Store_Cluster_50B_Triples.pdf">http://static.lod2.eu/Deliverables/LOD2_D2.1.3_LOD_Cloud_Hosted_On_The_LOD2_Knowledge_Store_Cluster_50B_Triples.pdf</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> StarDog results</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Succinct sheet describing results for BSBM, LUBM, SP2B:
</p>
<ul class="org-ul">
<li><a href="https://docs.google.com/spreadsheets/d/1oHSWX_0ChZ61ofipZ1CMsW7OhyujioR28AfHzU9d56k/pubhtml">https://docs.google.com/spreadsheets/d/1oHSWX_0ChZ61ofipZ1CMsW7OhyujioR28AfHzU9d56k/pubhtml</a>
</li>
</ul>
<p>
Nice variety but little detail
</p>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> TPC-H</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li><a href="http://www.tpc.org/tpch/results/tpch_price_perf_results.asp">http://www.tpc.org/tpch/results/tpch_price_perf_results.asp</a>
</li>
</ul>
<p>
Tons of detial, maybe not so relevant for us. Each run has representations at these levels of detail:
</p>
<ul class="org-ul">
<li>One line
<pre class="example">
Rank, Company, System, QphH, Price/QphH, Watts/KQphH, System Availability, Database, Operating System, Date Submitted, Cluster
</pre>
</li>
<li>Executive Summary: eg 13 pages
</li>
<li>Full Disclosure Report: eg 37 pages
</li>
<li>Supporting Files: 6Mb to 3Gb(!): won't look at them
</li>
</ul>
<p>
Results:
</p>
<ul class="org-ul">
<li>TPC-H Oracle:
<a href="http://www.tpc.org/tpch/results/tpch_result_detail.asp?id=111092601&layout=">http://www.tpc.org/tpch/results/tpch_result_detail.asp?id=111092601&layout=</a>
</li>
<li>TPC-H Huawei:
<a href="http://www.tpc.org/tpch/results/tpch_result_detail.asp?id=113111601&layout=">http://www.tpc.org/tpch/results/tpch_result_detail.asp?id=113111601&layout=</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> BM Statistics</h2>
<div class="outline-text-2" id="text-3">
<p>
The most important output of BM is the statistical representation of benchmark results.
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Stats Terms</h3>
<div class="outline-text-3" id="text-3-1">
<p>
It may be hard for someone without stats background to understand stats ontologies, so we provide first some terms from stats/OLAP.
Pleae note that these terms are slanted towards teh Cube ontology.
The key terms are Dimension, Attribute, Measure.
</p>
<ul class="org-ul">
<li>Cube: a multidimensional data structure carrying Observations
</li>
<li>Observation: a value plus a number of Components that help make sense of it
</li>
<li>Component: any of Dimension, Attribute or Measure; the facets defining the structure of a cube
</li>
<li>Data Structure Definition: the set of components defining a cube.
</li>
<li>Dimension: identifies the observations: where the observations lie
<ul class="org-ul">
<li>In a cube, all observations must have the same dimensions (no nulls are allowed), but some shortcuts/normalization are allowed
</li>
</ul>
</li>
<li>Attribute: qualify and interpret the value, eg: unit of measurement, estimated, provisional
</li>
<li>Measure: carries the observed value: what the values are
</li>
<li>measureType Dimension: a Dimension defining which Measure is applicable to an Observation (like a tag/discriminator in a <a href="https://en.wikipedia.org/wiki/Tagged_union">Tagged Union</a>)
</li>
<li>Slice: a cube subset where some of the Dimensions are fixed. Allows more economical cube description, and views over cubes (eg time series)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Stats Ontologies</h3>
<div class="outline-text-3" id="text-3-2">
<p>
We've looked at a number of stats ontologies, described in subsections below (the ones we use are described last). Legend:
</p>
<ul class="org-ul">
<li>x = well developed or widely used
</li>
<li>? = maybe will use
</li>
<li>+ = will use
</li>
</ul>
<table border="1" cellspacing="0" cellpadding="0" rules="all" frame="box">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>s</b></td>
<td class="left"><b>prefix</b></td>
<td class="left"><b>ontology</b></td>
<td class="left"><b>could be used for</b></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">Disco</td>
<td class="left">DDI RDF Discovery Vocabulary (Data Documentation Initiative)</td>
<td class="left">Detailed representation of stats, questions, cases..</td>
</tr>

<tr>
<td class="left">+</td>
<td class="left">QB</td>
<td class="left">RDF Data Cube Vocabulary</td>
<td class="left">"Canonical" stats ontology (SCOVO is the older version)</td>
</tr>

<tr>
<td class="left">?</td>
<td class="left">QB4OLAP</td>
<td class="left">Cube for OLAP, see <a href="https://books.google.bg/books?id=C7x_BAAAQBAJ&lpg=PA554&ots=WohdQ_jPkk&dq=qb%253AcomponentAttachment&pg=PA558#v=onepage&q&f=true">Data Warehouse Systems: Design and Implementation</a> sec 14.3.2 p.557</td>
<td class="left">Cube can't represent hierarchical dimensions</td>
</tr>

<tr>
<td class="left">+</td>
<td class="left">SDMX</td>
<td class="left">Statistical Data and Metadata eXchange</td>
<td class="left">common stat concepts, attributes, dimensions</td>
</tr>

<tr>
<td class="left">?</td>
<td class="left">SStat</td>
<td class="left">DDI Controlled Vocabularies - SummaryStatistic</td>
<td class="left">Concepts for summary stats (min, max, mean&#x2026;)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">XKOS</td>
<td class="left">Extended Knowledge Organisation System</td>
<td class="left">SKOS extension with statistical levels</td>
</tr>
</tbody>
</table>
</div>
