README.org
*** 270a
The site http://270a.info/ is a treasure trove of deployed datasets, patterns, codelists, etc.
It includes stats data from some 10 national and international stats offices, including Eurostat, ECB, WB, FAO, etc.

Interesting articles:
- http://csarven.ca/linked-sdmx-data
- http://csarven.ca/linked-statistical-data-analysis
- http://csarven.ca/statistical-linked-dataspaces (MS thesis)

Tool
- http://stats.270a.info/cube-designer: pick up cube components, generates a cube definition
Eg this is how I found they have concepts for Percentile:
#+BEGIN_SRC Turtle
<http://worldbank.270a.info/property/percentile> a qb:DimensionProperty , rdf:Property ;
  rdfs:label   "Percentile"@en;
  rdfs:range  <http://worldbank.270a.info/classification/percentile>;
  qb:codeList <http://worldbank.270a.info/classification/percentile>.
<http://worldbank.270a.info/classification/percentile/90> a skos:Concept;
  skos:inScheme <http://worldbank.270a.info/property/percentile>.
#+END_SRC

*** Disco
Disco looks very promising, and has detailed in-depth stats examples (a lot more elaborate than Cube).
It says "Disco only describes the structure of a dataset, but is not concerned with representing the actual data in it".
But in fact the examples show data representation as well.
- http://www.ddialliance.org/Specification/RDF/Discovery
- spec:  http://rdf-vocabulary.ddialliance.org/discovery.html
- info on Descriptive Stats:  http://rdf-vocabulary.ddialliance.org/discovery.html#dfn-disco-descriptivestatistics
*** DDI CV, SStat
DDI Controlled Vocabularies provides a number of codelists for common stats concepts.
- homepage: http://www.ddialliance.org/controlled-vocabularies
- formats: http://www.ddialliance.org/Specification/DDI-CV/
- RDF format: https://github.com/linked-statistics/DDI-controlled-vocabularies
**** Summary Statistics
In particular, Summary Statistics is relevant for us:
- A Summary Statistic is a single number representation of the characteristics of a set of values
- Amongst others, defines: ArithmeticMean, Minimum, Maximum, Median (50 percentile), NinthDecile (90 percentile), OtherPercentile
- HTML: http://www.ddialliance.org/Specification/DDI-CV/SummaryStatisticType_2.0.html
- RDF: https://github.com/linked-statistics/DDI-controlled-vocabularies/blob/master/SummaryStatisticType/SummaryStatisticType_2.0.rdf
This is a promising vocabulary and is worth watching. But our current representation doesn't use it because:
- These codelists are not deployed yet (the namespace does not resolve)
- We need 95 percentile and 99 percentile but SStat defines "OtherPercentile", so we'd still need to extend or tack a number somewhere
