README.html
<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> 270a</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
The site <a href="http://270a.info/">http://270a.info/</a> is a treasure trove of deployed datasets, patterns, codelists, etc.
It includes stats data from some 10 national and international stats offices, including Eurostat, ECB, WB, FAO, etc.
</p>

<p>
Interesting articles:
</p>
<ul class="org-ul">
<li><a href="http://csarven.ca/linked-sdmx-data">http://csarven.ca/linked-sdmx-data</a>
</li>
<li><a href="http://csarven.ca/linked-statistical-data-analysis">http://csarven.ca/linked-statistical-data-analysis</a>
</li>
<li><a href="http://csarven.ca/statistical-linked-dataspaces">http://csarven.ca/statistical-linked-dataspaces</a> (MS thesis)
</li>
</ul>

<p>
Tool
</p>
<ul class="org-ul">
<li><a href="http://stats.270a.info/cube-designer">http://stats.270a.info/cube-designer</a>: pick up cube components, generates a cube definition
</li>
</ul>
<p>
Eg this is how I found they have concepts for Percentile:
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #0000ff;">&lt;http://worldbank.270a.info/property/percentile&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">DimensionProperty</span> , <span style="color: #228b22;">rdf:</span><span style="color: #008b8b;">Property</span> ;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>   <span style="color: #8b2252;">"Percentile"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span>  <span style="color: #0000ff;">&lt;http://worldbank.270a.info/classification/percentile&gt;</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">codeList</span> <span style="color: #0000ff;">&lt;http://worldbank.270a.info/classification/percentile&gt;</span><span style="color: #228b22;">.</span>
<span style="color: #0000ff;">&lt;http://worldbank.270a.info/classification/percentile/90&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #0000ff;">&lt;http://worldbank.270a.info/property/percentile&gt;</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Disco</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Disco looks very promising, and has detailed in-depth stats examples (a lot more elaborate than Cube).
It says "Disco only describes the structure of a dataset, but is not concerned with representing the actual data in it".
But in fact the examples show data representation as well.
</p>
<ul class="org-ul">
<li><a href="http://www.ddialliance.org/Specification/RDF/Discovery">http://www.ddialliance.org/Specification/RDF/Discovery</a>
</li>
<li>spec:  <a href="http://rdf-vocabulary.ddialliance.org/discovery.html">http://rdf-vocabulary.ddialliance.org/discovery.html</a>
</li>
<li>info on Descriptive Stats:  <a href="http://rdf-vocabulary.ddialliance.org/discovery.html#dfn-disco-descriptivestatistics">http://rdf-vocabulary.ddialliance.org/discovery.html#dfn-disco-descriptivestatistics</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> DDI CV, SStat</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
DDI Controlled Vocabularies provides a number of codelists for common stats concepts.
</p>
<ul class="org-ul">
<li>homepage: <a href="http://www.ddialliance.org/controlled-vocabularies">http://www.ddialliance.org/controlled-vocabularies</a>
</li>
<li>formats: <a href="http://www.ddialliance.org/Specification/DDI-CV/">http://www.ddialliance.org/Specification/DDI-CV/</a>
</li>
<li>RDF format: <a href="https://github.com/linked-statistics/DDI-controlled-vocabularies">https://github.com/linked-statistics/DDI-controlled-vocabularies</a>
</li>
</ul>
</div>
<div id="outline-container-sec-3-2-3-1" class="outline-5">
<h5 id="sec-3-2-3-1"><span class="section-number-5">3.2.3.1</span> Summary Statistics</h5>
<div class="outline-text-5" id="text-3-2-3-1">
<p>
In particular, Summary Statistics is relevant for us:
</p>
<ul class="org-ul">
<li>A Summary Statistic is a single number representation of the characteristics of a set of values
</li>
<li>Amongst others, defines: ArithmeticMean, Minimum, Maximum, Median (50 percentile), NinthDecile (90 percentile), OtherPercentile
</li>
<li>HTML: <a href="http://www.ddialliance.org/Specification/DDI-CV/SummaryStatisticType_2.0.html">http://www.ddialliance.org/Specification/DDI-CV/SummaryStatisticType_2.0.html</a>
</li>
<li>RDF: <a href="https://github.com/linked-statistics/DDI-controlled-vocabularies/blob/master/SummaryStatisticType/SummaryStatisticType_2.0.rdf">https://github.com/linked-statistics/DDI-controlled-vocabularies/blob/master/SummaryStatisticType/SummaryStatisticType_2.0.rdf</a>
</li>
</ul>
<p>
This is a promising vocabulary and is worth watching. But our current representation doesn't use it because:
</p>
<ul class="org-ul">
<li>These codelists are not deployed yet (the namespace does not resolve)
</li>
<li>We need 95 percentile and 99 percentile but SStat defines "OtherPercentile", so we'd still need to extend or tack a number somewhere
</li>
</ul>
</div>
</div>
</div>
