README.org
*** SDMX
SDMX is an ISO spec providing common stats concepts and components (dimensions, attributes and measures).
Originally defined in XML and EDI, it's also translated to RDF.
SDMX depends on Cube, but Cube may be used without SDMX.

Since the same concept (eg Gender) can be used in various roles (eg a Dimension or a Measure), skos:Concepts are used to tie them together.
A component that is a qb:CodedProperty may also link to a qb:codeList (a skos:ConceptScheme or ad-hoc qb:HierarchicalCodeList).

Say we want to provide a Dimension describing Summary Stats (mean, min, max, etc).
We define a property ~bm-stat:dimStat~ and tie it up to the concept ~bm-stat:conceptStat~ and a codeList ~bm-stat:stat~:
#+BEGIN_SRC Turtle
bm-stat:dimStat a rdf:Property, qb:DimensionProperty, qb:CodedProperty;
  rdfs:label "Stat"@en;
  rdfs:comment "Statistic being measured (eg min, max)"@en;
  rdfs:range bm:Stat;
  qb:concept bm-stat:conceptStat;
  qb:codeList bm-stat:stat.
#+END_SRC
We also define a class ~bm-stat:Stat~ that's co-extensive with the codeList ~bm-stat:stat~, to allow rdfs:range declaration on the DimensionProperty:
#+BEGIN_SRC Turtle
bm-stat:stat a skos:ConceptScheme;
  rdfs:label "Summary Statistics scheme"@en;
  rdfs:comment "Single number representation of the characteristics of a set of values"@en;
  rdfs:seeAlso bm-stat:Stat.

bm-stat:Stat a rdfs:Class, owl:Class;
  rdfs:label "Stat"@en;
  rdfs:comment "Codelist (enumeration) of Summary Statistics concepts, eg min, max"@en;
  rdfs:subClassOf skos:Concept;
  rdfs:seeAlso bm-stat:stat.
#+END_SRC
Finally, we define the individual values as both instances of the class, and ~skos:inScheme~ of the codeList:
#+BEGIN_SRC Turtle
bm-stat:min a skos:Concept, bm-stat:Stat ;
  rdfs:label "Min"@en;
  rdfs:comment "Minimum value of an observation"@en;
  skos:inScheme bm-stat:stat.
#+END_SRC

It is tedious to define all these interlinked entities (a consistent naming approach is essential!)
Such detailed self-description allows sophisticated cube exploration UIs and SPARQL query generation (rumor has it).
However, we think it would be easier to develop queries by hand, so we may forgo the use of SDMX in future releases.

