README.html
<div id="outline-container-sec-3-2-4" class="outline-4">
<h4 id="sec-3-2-4"><span class="section-number-4">3.2.4</span> SDMX</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
SDMX is an ISO spec providing common stats concepts and components (dimensions, attributes and measures).
Originally defined in XML and EDI, it's also translated to RDF.
SDMX depends on Cube, but Cube may be used without SDMX.
</p>

<p>
Since the same concept (eg Gender) can be used in various roles (eg a Dimension or a Measure), skos:Concepts are used to tie them together.
A component that is a qb:CodedProperty may also link to a qb:codeList (a skos:ConceptScheme or ad-hoc qb:HierarchicalCodeList).
</p>

<p>
Say we want to provide a Dimension describing Summary Stats (mean, min, max, etc).
We define a property <code>bm-stat:dimStat</code> and tie it up to the concept <code>bm-stat:conceptStat</code> and a codeList <code>bm-stat:stat</code>:
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">rdf:</span><span style="color: #008b8b;">Property,</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">DimensionProperty,</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">CodedProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Stat"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Statistic being measured (eg min, max)"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span> <span style="color: #228b22;">bm:</span><span style="color: #008b8b;">Stat</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">conceptStat</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">codeList</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">stat</span>.
</pre>
</div>
<p>
We also define a class <code>bm-stat:Stat</code> that's co-extensive with the codeList <code>bm-stat:stat</code>, to allow rdfs:range declaration on the DimensionProperty:
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">stat</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">ConceptScheme</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Summary Statistics scheme"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Single number representation of the characteristics of a set of values"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">seeAlso</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">Stat</span><span style="color: #228b22;">.</span>

<span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">Stat</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">Class,</span> <span style="color: #228b22;">owl:</span><span style="color: #008b8b;">Class</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Stat"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Codelist (enumeration) of Summary Statistics concepts, eg min, max"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">subClassOf</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">seeAlso</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">stat</span>.
</pre>
</div>
<p>
Finally, we define the individual values as both instances of the class, and <code>skos:inScheme</code> of the codeList:
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">min</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept,</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">Stat</span> ;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Min"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Minimum value of an observation"</span>@en;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">stat</span>.
</pre>
</div>

<p>
It is tedious to define all these interlinked entities (a consistent naming approach is essential!)
Such detailed self-description allows sophisticated cube exploration UIs and SPARQL query generation (rumor has it).
However, we think it would be easier to develop queries by hand, so we may forgo the use of SDMX in future releases.
</p>
</div>
</div>
