README.org
*** Cube
Cube is the "canonical" stats ontology adopted by W3C. It can work together or without SDMX.
- spec: http://www.w3.org/TR/vocab-data-cube
- domain model: http://www.w3.org/TR/vocab-data-cube/#outline
- complete example: http://www.w3.org/TR/vocab-data-cube/#full-example
- ontologies resolve to: http://publishing-statistical-data.googlecode.com/svn/trunk/specs/src/main/vocab/
- forum: https://groups.google.com/forum/#!topic/publishing-statistical-data

There are many important parts to the specification, but we highlight only a couple in this section, and a more technical one in the next section.
- [[http://www.w3.org/TR/vocab-data-cube/#dsd-mm][Multiple Measures]] ::
  If you need Observations that have several different Measures, there are several approaches:
  - [[http://www.w3.org/TR/vocab-data-cube/#h4_dsd-mm-obs][Multi-measure observations]]. Each observation has the same set of measures, and attributes can't be applied separately.
    #+BEGIN_SRC Turtle
  eg:o1 a ob:Observation;
    eg:attrUnit unit:MilliSecond;
    eg:measure1 123;
    eg:measure2 456.
    #+END_SRC
  - [[http://www.w3.org/TR/vocab-data-cube/#h4_dsd-mm-dim][Measure dimension]]. Each observation has one applicable measure, selected by qb:measureType (as a tag/discriminator in a in a [[https://en.wikipedia.org/wiki/Tagged_union][Tagged Union]]).
    Different attributes can be applied. This is a more regular approach, recommended by SDMX.
    #+BEGIN_SRC Turtle
  eg:o1 a ob:Observation;
    eg:attrUnit unit:MilliSecond;
    qb:measureType eg:measure1;
    eg:measure1 123.
  eg:o2 a ob:Observation;
    eg:attrUnit unit:Second;
    qb:measureType eg:measure2;
    eg:measure2 456.
    #+END_SRC
  - Structured observation. You could put several values in one node, but then cannot Slice them independently
    #+BEGIN_SRC Turtle
  eg:o1 a ob:Observation;
    eg:attrUnit unit:MilliSecond;
    eg:measure [eg:value1 123; eg:value2 456].
    #+END_SRC
- [[http://www.w3.org/TR/vocab-data-cube/#dsd-dsd][Data Structure Definition]] (DSD) ::
  The structure of a Cube is described with a DSD.
  The same DSD is normally reused between many Cubes with the same structure
  (eg a SNB DSD will be used by the stats cubes of all SNB Runs).
  A DSD is created by listing the qb:components that apply to a cube, and optionally defining [[http://www.w3.org/TR/vocab-data-cube/#slices][SliceKeys]].
  Consistent naming of different kinds of components (eg dim, attr, meas) is essential to facilitate understanding. Eg
  #+BEGIN_SRC Turtle
snb-stat:dsd a qb:DataStructureDefinition;
  ob:component [qb:dimension bm-stat:dimScaleFactor],  # dataset size
  ob:component [qb:dimension bm-stat:dimStat],         # mean, min, max, ...
  ob:component [qb:attribute bm-stat:attrUnit],        # MilliSecond, Second, ...
  ob:component [qb:dimension qb:measureType],          # discriminator for the rest
  ob:component [qb:measure   bm-stat:measRuntime],     # observe Runtime, or
  ob:component [qb:measure   bm-stat:measDelayTime].   # observe DelayTime
  #+END_SRC
- componentAttachment ::
  Every Observation must have defined values for all Dimensions and all mandatory Attributes.
  However, Cube allows some shortcuts by letting you specify a Dimension/Attribute
  at the level of the cube, slice, or a Measure.
  This last option is unclear in the spec, see my [[https://groups.google.com/forum/#!topic/publishing-statistical-data/NZcaUhMu0_k][forum posting]] and the next section.

