README.html

<div id="outline-container-sec-3-2-5" class="outline-4">
<h4 id="sec-3-2-5"><span class="section-number-4">3.2.5</span> Cube</h4>
<div class="outline-text-4" id="text-3-2-5">
<p>
Cube is the "canonical" stats ontology adopted by W3C. It can work together or without SDMX.
</p>
<ul class="org-ul">
<li>spec: <a href="http://www.w3.org/TR/vocab-data-cube">http://www.w3.org/TR/vocab-data-cube</a>
</li>
<li>domain model: <a href="http://www.w3.org/TR/vocab-data-cube/#outline">http://www.w3.org/TR/vocab-data-cube/#outline</a>
</li>
<li>complete example: <a href="http://www.w3.org/TR/vocab-data-cube/#full-example">http://www.w3.org/TR/vocab-data-cube/#full-example</a>
</li>
<li>ontologies resolve to: <a href="http://publishing-statistical-data.googlecode.com/svn/trunk/specs/src/main/vocab/">http://publishing-statistical-data.googlecode.com/svn/trunk/specs/src/main/vocab/</a>
</li>
<li>forum: <a href="https://groups.google.com/forum/#!topic/publishing-statistical-data">https://groups.google.com/forum/#!topic/publishing-statistical-data</a>
</li>
</ul>

<p>
There are many important parts to the specification, but we highlight only a couple in this section, and a more technical one in the next section.
</p>
<dl class="org-dl">
<dt> <a href="http://www.w3.org/TR/vocab-data-cube/#dsd-mm">Multiple Measures</a> </dt><dd>  If you need Observations that have several different Measures, there are several approaches:
<ul class="org-ul">
<li><a href="http://www.w3.org/TR/vocab-data-cube/#h4_dsd-mm-obs">Multi-measure observations</a>. Each observation has the same set of measures, and attributes can't be applied separately.
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">eg:</span><span style="color: #008b8b;">o1</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">ob:</span><span style="color: #008b8b;">Observation</span>;
  <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span>;
  <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">measure1</span> 123;
  <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">measure2</span> 456.
</pre>
</div>
</li>
<li><a href="http://www.w3.org/TR/vocab-data-cube/#h4_dsd-mm-dim">Measure dimension</a>. Each observation has one applicable measure, selected by qb:measureType (as a tag/discriminator in a in a <a href="https://en.wikipedia.org/wiki/Tagged_union">Tagged Union</a>).
Different attributes can be applied. This is a more regular approach, recommended by SDMX.
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">eg:</span><span style="color: #008b8b;">o1</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">ob:</span><span style="color: #008b8b;">Observation</span>;
  <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">measureType</span> <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">measure1</span>;
  <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">measure1</span> <span style="color: #228b22;">123.</span>
<span style="color: #228b22;">eg:</span><span style="color: #008b8b;">o2</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">ob:</span><span style="color: #008b8b;">Observation</span>;
  <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">Second</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">measureType</span> <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">measure2</span>;
  <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">measure2</span> 456.
</pre>
</div>
</li>
<li>Structured observation. You could put several values in one node, but then cannot Slice them independently
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">eg:</span><span style="color: #008b8b;">o1</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">ob:</span><span style="color: #008b8b;">Observation</span>;
  <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span>;
  <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">measure</span> <span style="color: #228b22;">[eg:</span><span style="color: #008b8b;">value1</span> 123; <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">value2</span> 456].
</pre>
</div>
</li>
</ul>
</dd>
<dt> <a href="http://www.w3.org/TR/vocab-data-cube/#dsd-dsd">Data Structure Definition</a> (DSD) </dt><dd>  The structure of a Cube is described with a DSD.
The same DSD is normally reused between many Cubes with the same structure
(eg a SNB DSD will be used by the stats cubes of all SNB Runs).
A DSD is created by listing the qb:components that apply to a cube, and optionally defining <a href="http://www.w3.org/TR/vocab-data-cube/#slices">SliceKeys</a>.
Consistent naming of different kinds of components (eg dim, attr, meas) is essential to facilitate understanding. Eg
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">dsd</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">DataStructureDefinition</span>;
  <span style="color: #228b22;">ob:</span><span style="color: #008b8b;">component</span> <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimScaleFactor],</span>  <span style="color: #b22222;"># dataset size</span>
  <span style="color: #228b22;">ob:</span><span style="color: #008b8b;">component</span> <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat],</span>         <span style="color: #b22222;"># mean, min, max, ...</span>
  <span style="color: #228b22;">ob:</span><span style="color: #008b8b;">component</span> <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit],</span>        <span style="color: #b22222;"># MilliSecond, Second, ...</span>
  <span style="color: #228b22;">ob:</span><span style="color: #008b8b;">component</span> <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">measureType],</span>          <span style="color: #b22222;"># discriminator for the rest</span>
  <span style="color: #228b22;">ob:</span><span style="color: #008b8b;">component</span> <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measRuntime],</span>     <span style="color: #b22222;"># observe Runtime, or</span>
  <span style="color: #228b22;">ob:</span><span style="color: #008b8b;">component</span> <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measDelayTime]</span>.   <span style="color: #b22222;"># observe DelayTime</span>
</pre>
</div>
</dd>
<dt> componentAttachment </dt><dd>  Every Observation must have defined values for all Dimensions and all mandatory Attributes.
However, Cube allows some shortcuts by letting you specify a Dimension/Attribute
at the level of the cube, slice, or a Measure.
This last option is unclear in the spec, see my <a href="https://groups.google.com/forum/#!topic/publishing-statistical-data/NZcaUhMu0_k">forum posting</a> and the next section.
</dd>
</dl>
</div>
</div>
