README.org
*** Cube Normalization
If you specify property ~qb:componentAttachment~ with of the values ~qb:DataSet~, ~qb:Slice~, ~qb:MeasureProperty~
for a Dimension/Attribute, then you fix the value for that Dimension/Attribute at the corresponding higher level, not in the Observation.
For example (not showing ~qb:DataSet~ for brevity):
#+BEGIN_SRC Turtle
eg:myDSD a qb:DataStructureDefinition;
  qb:component [qb:measure eg:measure1 ];
  qb:component [qb:measure eg:measure2 ];
  qb:component [qb:attribute eg:measUnit; qb:componentAttachment qb:MeasureProperty].

eg:measure1 a qb:MeasureProperty;
  eg:measUnit unit:Percent .

eg:measure2 a qb:MeasureProperty;
  eg:measUnit unit:Number .

eg:observation1 a qb:Observation;
  eg:measure1 55;   # Percent
  eg:measure2 1333. # Number
#+END_SRC

This allows abbreviated (more economical) cube representation.
But to simplify SPARQL queries and Integrity constraint checking,
a [[http://www.w3.org/TR/vocab-data-cube/#normalize-algorithm][Normalization Algorithm]] is defined that expands (flattens) the cube by transferring the values from the higher level to each Observation.

The algorithm is defined in terms of SPARQL updates (INSERT WHERE).
- Phase 1 are normal RDFS rules
- Phase 2 are the Cube-specific rules.
Unfortunately, the above case won't be handled by Phase 2, since it shows only attachment to qb:DataSet or qb:Slice.

We find an extra fourth rule *commented-out* at the original source
https://code.google.com/p/publishing-statistical-data/source/browse/trunk/src/main/resources/flatten.ru
(in this case ru is the extension for SPARQL Update):
#+BEGIN_SRC SPARQL
# Measure property attachments
  INSERT {
      ?obs  ?comp ?value
  } WHERE {
      ?spec  qb:componentProperty ?comp ;
             qb:componentAttachment qb:MeasureProperty .
      ?dataset qb:structure [qb:component ?spec] .
      ?comp    a qb:AttributeProperty .
      ?measure a qb:MeasureProperty;
               ?comp ?value .
      ?obs     qb:dataSet ?dataset;
               ?measure [] .
  }
#+END_SRC
It transfers from a Measure to an Observation, iff:
- An Attribute ~?comp~ is attached to a MeasureProperty,
- The Measure is used for the Observation
- The attribute is declared to have ~qb:componentAttachment qb:MeasureProperty~. To see
  this, it helps to rewrite the WHERE clause like this
  (~qb:component~ is super-property of ~qb:attribute~):
  #+BEGIN_SRC SPARQL
    ?dataset qb:structure [a qb:DataStructureDefinition;
      qb:component
        [qb:attribute ?attr; qb:componentAttachment qb:MeasureProperty]].
    ?attr    a qb:AttributeProperty .
    ?measure a qb:MeasureProperty;
      ?attr ?value .
    ?obs a qb:Observation;
      qb:dataSet ?dataset;
      ?measure ?measValue.
  #+END_SRC
*** Normalization with Ontotext GraphDb Rules
INSERT WHERE works fine for static/small datasets, but what if you have a huge Cube that's updated incrementally?
(Eg a cube to which observations are being added by a streaming benchmark driver).
Ontotext GraphDb rules work better in such situation, since they allow you to insert and delete triples freely, while maintaining consistency.

The script [[./cube-normalize.pl]] takes a .ru file as described above and produces a rule
file [[./cube-normalize.pie]] (in addition, a RDFS rules file needs to be loaded or merged with this one).
Eg the *Measure property attachments* INSERT WHERE rule from the previous section is translated to this rule:
#+BEGIN_SRC
  Id: qb2_Measure_property_attachments
    spec  <qb:componentProperty> comp
    spec  <qb:componentAttachment> <qb:MeasureProperty>
    dataset <qb:structure> struc
    struc   <qb:component> spec
    comp    <rdf:type> <qb:AttributeProperty>
    measure <rdf:type> <qb:MeasureProperty>
    measure comp value
    obs     <qb:dataSet> dataset
    obs     measure blank
    --------------------------
    obs  comp value
#+END_SRC
In addition, it adds an inverse propertyChainAxiom for the loop between DataSet, Slice and Observation (see the Cube [[http://www.w3.org/TR/vocab-data-cube/#outline][domain model]]):
#+BEGIN_SRC
  Id: qbX_slice_observation_dataSet
    dataset <qb:slice>       slice
    slice   <qb:observation> obs
    --------------------------------
    obs     <qb:dataSet>     dataset
#+END_SRC
This allows you to skip ~qb:dataSet~ for an Observation that's already attached to a Slice of the cube using ~qb:observation~.

Note: "qb2" stands for "Cube Phase2 normalization", and "qbX" stands for "I'm too lazy to repeat myself".

