README.html

<div id="outline-container-sec-3-2-6" class="outline-4">
<h4 id="sec-3-2-6"><span class="section-number-4">3.2.6</span> Cube Normalization</h4>
<div class="outline-text-4" id="text-3-2-6">
<p>
If you specify property <code>qb:componentAttachment</code> with of the values <code>qb:DataSet</code>, <code>qb:Slice</code>, <code>qb:MeasureProperty</code>
for a Dimension/Attribute, then you fix the value for that Dimension/Attribute at the corresponding higher level, not in the Observation.
For example (not showing <code>qb:DataSet</code> for brevity):
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">eg:</span><span style="color: #008b8b;">myDSD</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">DataStructureDefinition</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">component</span> <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span> <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">measure1</span> ];
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">component</span> <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span> <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">measure2</span> ];
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">component</span> <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">measUnit</span>; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty]</span><span style="color: #228b22;">.</span>

<span style="color: #228b22;">eg:</span><span style="color: #008b8b;">measure1</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty</span>;
  <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">measUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">Percent</span> <span style="color: #228b22;">.</span>

<span style="color: #228b22;">eg:</span><span style="color: #008b8b;">measure2</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty</span>;
  <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">measUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">Number</span> <span style="color: #228b22;">.</span>

<span style="color: #228b22;">eg:</span><span style="color: #008b8b;">observation1</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">Observation</span>;
  <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">measure1</span> 55;   <span style="color: #b22222;"># Percent</span>
  <span style="color: #228b22;">eg:</span><span style="color: #008b8b;">measure2</span> 1333. <span style="color: #b22222;"># Number</span>
</pre>
</div>

<p>
This allows abbreviated (more economical) cube representation.
But to simplify SPARQL queries and Integrity constraint checking,
a <a href="http://www.w3.org/TR/vocab-data-cube/#normalize-algorithm">Normalization Algorithm</a> is defined that expands (flattens) the cube by transferring the values from the higher level to each Observation.
</p>

<p>
The algorithm is defined in terms of SPARQL updates (INSERT WHERE).
</p>
<ul class="org-ul">
<li>Phase 1 are normal RDFS rules
</li>
<li>Phase 2 are the Cube-specific rules.
</li>
</ul>
<p>
Unfortunately, the above case won't be handled by Phase 2, since it shows only attachment to qb:DataSet or qb:Slice.
</p>

<p>
We find an extra fourth rule <b>commented-out</b> at the original source
<a href="https://code.google.com/p/publishing-statistical-data/source/browse/trunk/src/main/resources/flatten.ru">https://code.google.com/p/publishing-statistical-data/source/browse/trunk/src/main/resources/flatten.ru</a>
(in this case ru is the extension for SPARQL Update):
</p>
<div class="org-src-container">

<pre class="src src-SPARQL"><span style="color: #b22222;"># Measure property attachments</span>
  INSERT {
      ?obs  ?comp ?value
  } WHERE {
      ?spec  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentProperty</span> ?comp ;
             <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty</span> .
      ?dataset <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">structure</span> <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">component</span> ?spec] .
      ?comp    <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">AttributeProperty</span> .
      ?measure <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty</span>;
               ?comp ?value .
      ?obs     <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">dataSet</span> ?dataset;
               ?measure [] .
  }
</pre>
</div>
<p>
It transfers from a Measure to an Observation, iff:
</p>
<ul class="org-ul">
<li>An Attribute <code>?comp</code> is attached to a MeasureProperty,
</li>
<li>The Measure is used for the Observation
</li>
<li>The attribute is declared to have <code>qb:componentAttachment qb:MeasureProperty</code>. To see
this, it helps to rewrite the WHERE clause like this
(<code>qb:component</code> is super-property of <code>qb:attribute</code>):
<div class="org-src-container">

<pre class="src src-SPARQL">?dataset <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">structure</span> [<span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">DataStructureDefinition</span>;
  <span style="color: #228b22;">qb:</span>component
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> ?attr; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty]]</span>.
?attr    <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">AttributeProperty</span> .
?measure <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty</span>;
  ?attr ?value .
?obs <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">Observation</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">dataSet</span> ?dataset;
  ?measure ?measValue.
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2-7" class="outline-4">
<h4 id="sec-3-2-7"><span class="section-number-4">3.2.7</span> Normalization with Ontotext GraphDb Rules</h4>
<div class="outline-text-4" id="text-3-2-7">
<p>
INSERT WHERE works fine for static/small datasets, but what if you have a huge Cube that's updated incrementally?
(Eg a cube to which observations are being added by a streaming benchmark driver).
Ontotext GraphDb rules work better in such situation, since they allow you to insert and delete triples freely, while maintaining consistency.
</p>

<p>
The script <a href="./cube-normalize.pl">./cube-normalize.pl</a> takes a .ru file as described above and produces a rule
file <a href="./cube-normalize.pie">./cube-normalize.pie</a> (in addition, a RDFS rules file needs to be loaded or merged with this one).
Eg the <b>Measure property attachments</b> INSERT WHERE rule from the previous section is translated to this rule:
</p>
<pre class="example">
Id: qb2_Measure_property_attachments
  spec  &lt;qb:componentProperty&gt; comp
  spec  &lt;qb:componentAttachment&gt; &lt;qb:MeasureProperty&gt;
  dataset &lt;qb:structure&gt; struc
  struc   &lt;qb:component&gt; spec
  comp    &lt;rdf:type&gt; &lt;qb:AttributeProperty&gt;
  measure &lt;rdf:type&gt; &lt;qb:MeasureProperty&gt;
  measure comp value
  obs     &lt;qb:dataSet&gt; dataset
  obs     measure blank
  --------------------------
  obs  comp value
</pre>
<p>
In addition, it adds an inverse propertyChainAxiom for the loop between DataSet, Slice and Observation (see the Cube <a href="http://www.w3.org/TR/vocab-data-cube/#outline">domain model</a>):
</p>
<pre class="example">
Id: qbX_slice_observation_dataSet
  dataset &lt;qb:slice&gt;       slice
  slice   &lt;qb:observation&gt; obs
  --------------------------------
  obs     &lt;qb:dataSet&gt;     dataset
</pre>
<p>
This allows you to skip <code>qb:dataSet</code> for an Observation that's already attached to a Slice of the cube using <code>qb:observation</code>.
</p>

<p>
Note: "qb2" stands for "Cube Phase2 normalization", and "qbX" stands for "I'm too lazy to repeat myself".
</p>
</div>
</div>
