README.org
*** Benchmark Result Dimensions
We will document all particulars of a benchmark run in ~bm:Run~, including:
- Full hardware and software details of the System Under Test
- URLs of configuration files of the System Under Test, test driver, etc
- RDF nodes with property-value for important configuration parameters
In contrast, the Benchmark Result examples (eg [[SNB Turtle]] below) as of <2015-01-21> use a really minimal set of dimensions:
- ~dimQuery~ states which query (or Total) the measurement pertains to
- ~dimStat~ states which Summary Statistic [[Summary Statistics]] (eg mean, min, max) is expressed by the measurement
To compare or chart numbers across different Runs (varying eg database, release, database settings, hardware, benchmark version), 
we need to use more of the Run parameters as cube Dimensions.

The down-side of every dimension is that it not only adds a triple to every observation,
but also multiplies the number of observations through Cube Normalization [[Cube Normalization]].
Eg assume you have a cube with D dimensions, O observations and (D+X)*O triples (where X is proportional to the number of measures and attributes)
and you add an D+1'th dimension with Y values.
You'll end up with O*Y observations and (D+X+1)*O*Y triples.
 
So what are the important benchmark Run parameters to add as Dimensions? Currently proposed:
- scaleFactor: to compare performance against dataset size
- database release: to compare the evolution of a database in time
- database: to compare across databases (note: this is implied by "database release", so we could spare it)
- RAM size (Gb): a key hardware parameter

How about these?
- Loading parameters such as number of agents/threads (SNB threadCount), SNB timeCompressionRatio, SNB gctDeltaDuration. 
  IMHO the benchmark sponsor is supposed to optimize these until maximum database performance is achieved, so we don't compare across them
- CPU and Disk performance. But is there a standardized way to report them?
- query mix, eg which queries are enabled, whether analytical queries were included, query interleave times, etc.
  The number and times for each query type are reported through ~dimQuery~, 
  but the mix as a whole also affects the performance of each query, so maybe we need to capture this.
  But how? A query mix is a complex structure in itself...
- SUT platform such as operating system, JVM etc: it's possible (but maybe not very likely) we'd want to compare against such factors
- Total SUT price. TCP captures that (and queries per second per dollar), so maybe we should too

In contrast, we don't need to capture the folowing as Dimensions:
- benchmark: can't compare across benchmarks (can't compare apples to oranges)
- benchmark version: this is a key parameter of a Run, but again we can't compare apples to oranges
- driver version: an important parameter of a Run, but it's not supposed to affect benchmark performance
- dataset parameters such as dictionaries used, network distributions, literal distributions, etc.

** SNB Sample1
The SNB spec [[https://github.com/ldbc/ldbc_snb_docs/blob/master/LDBC_SNB_v0.2.0.pdf][LDBC_SNB_v0.2.0]] sec 3.3 "Gathering the results" provides the example [[./snb-sample1.json]]:
#+BEGIN_SRC js
      "name": "Query1",
      "count": 50,
      "unit": "MILLISECONDS",
      "run_time": {
        "name": "Runtime",
        "unit": "MILLISECONDS",
        "count": 50,
        "mean": 100,
        "min": 2,
        "max": 450,
        "50th_percentile": 98,
        "90th_percentile": 129,
        "95th_percentile": 432,
        "99th_percentile": 444
      },
      "start_time_delay": {
        "name": "Start Time Delay",
        "unit": "MILLISECONDS",
        "count": 7,
        "mean": 3.5714285714285716,
        "min": 0,
        "max": 25,
        "50th_percentile": 0,
        "90th_percentile": 0,
        "95th_percentile": 25,
        "99th_percentile": 25
      },
      "result_code": {
        "name": "Result Code",
        "unit": "Result Code",
        "count": 50,
        "all_values": {
          "0": 42,
          "1": 8
        }
      }
#+END_SRC
It provides stats for 50 executions of Query1 along 3 measures:
- Runtime: query execution time
- StartDelay: delay between scheduled and actual query start time.
- Result: result code

Note: queries are scheduled by the driver using these parameters:
- LdbcQueryN_interleave: interval between successive executions of query N
- timeCompressionRatio: multiplier to compress/stretch all interleave times
- toleratedExecutionDelay: if start delay exceeds this, a timeout is recorded

These measures are interesting, since:
- We have 2 numeric measures (MilliSeconds) and 1 categorial (result code)
- The numeric measures provide a number of Summary Statistics

