README.html

<div id="outline-container-sec-3-2-8" class="outline-4">
<h4 id="sec-3-2-8"><span class="section-number-4">3.2.8</span> Benchmark Result Dimensions</h4>
<div class="outline-text-4" id="text-3-2-8">
<p>
We will document all particulars of a benchmark run in <code>bm:Run</code>, including:
</p>
<ul class="org-ul">
<li>Full hardware and software details of the System Under Test
</li>
<li>URLs of configuration files of the System Under Test, test driver, etc
</li>
<li>RDF nodes with property-value for important configuration parameters
</li>
</ul>
<p>
In contrast, the Benchmark Result examples (eg <a href="#sec-3-3-1">3.3.1</a> below) as of <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-01-21&gt;</span></span> use a really minimal set of dimensions:
</p>
<ul class="org-ul">
<li><code>dimQuery</code> states which query (or Total) the measurement pertains to
</li>
<li><code>dimStat</code> states which Summary Statistic <a href="#sec-3-2-3-1">3.2.3.1</a> (eg mean, min, max) is expressed by the measurement
</li>
</ul>
<p>
To compare or chart numbers across different Runs (varying eg database, release, database settings, hardware, benchmark version), 
we need to use more of the Run parameters as cube Dimensions.
</p>

<p>
The down-side of every dimension is that it not only adds a triple to every observation,
but also multiplies the number of observations through Cube Normalization <a href="#sec-3-2-6">3.2.6</a>.
Eg assume you have a cube with D dimensions, O observations and (D+X)*O triples (where X is proportional to the number of measures and attributes)
and you add an D+1'th dimension with Y values.
You'll end up with O*Y observations and (D+X+1)*O*Y triples.
</p>

<p>
So what are the important benchmark Run parameters to add as Dimensions? Currently proposed:
</p>
<ul class="org-ul">
<li>scaleFactor: to compare performance against dataset size
</li>
<li>database release: to compare the evolution of a database in time
</li>
<li>database: to compare across databases (note: this is implied by "database release", so we could spare it)
</li>
<li>RAM size (Gb): a key hardware parameter
</li>
</ul>

<p>
How about these?
</p>
<ul class="org-ul">
<li>Loading parameters such as number of agents/threads (SNB threadCount), SNB timeCompressionRatio, SNB gctDeltaDuration. 
IMHO the benchmark sponsor is supposed to optimize these until maximum database performance is achieved, so we don't compare across them
</li>
<li>CPU and Disk performance. But is there a standardized way to report them?
</li>
<li>query mix, eg which queries are enabled, whether analytical queries were included, query interleave times, etc.
The number and times for each query type are reported through <code>dimQuery</code>, 
but the mix as a whole also affects the performance of each query, so maybe we need to capture this.
But how? A query mix is a complex structure in itself&#x2026;
</li>
<li>SUT platform such as operating system, JVM etc: it's possible (but maybe not very likely) we'd want to compare against such factors
</li>
<li>Total SUT price. TCP captures that (and queries per second per dollar), so maybe we should too
</li>
</ul>

<p>
In contrast, we don't need to capture the folowing as Dimensions:
</p>
<ul class="org-ul">
<li>benchmark: can't compare across benchmarks (can't compare apples to oranges)
</li>
<li>benchmark version: this is a key parameter of a Run, but again we can't compare apples to oranges
</li>
<li>driver version: an important parameter of a Run, but it's not supposed to affect benchmark performance
</li>
<li>dataset parameters such as dictionaries used, network distributions, literal distributions, etc.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> SNB Sample1</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The SNB spec <a href="https://github.com/ldbc/ldbc_snb_docs/blob/master/LDBC_SNB_v0.2.0.pdf">LDBC_SNB_v0.2.0</a> sec 3.3 "Gathering the results" provides the example <a href="./snb-sample1.json">./snb-sample1.json</a>:
</p>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #8b2252;">"name"</span>: <span style="color: #8b2252;">"Query1"</span>,
<span style="color: #8b2252;">"count"</span>: 50,
<span style="color: #8b2252;">"unit"</span>: <span style="color: #8b2252;">"MILLISECONDS"</span>,
<span style="color: #8b2252;">"run_time"</span>: {
  <span style="color: #8b2252;">"name"</span>: <span style="color: #8b2252;">"Runtime"</span>,
  <span style="color: #8b2252;">"unit"</span>: <span style="color: #8b2252;">"MILLISECONDS"</span>,
  <span style="color: #8b2252;">"count"</span>: 50,
  <span style="color: #8b2252;">"mean"</span>: 100,
  <span style="color: #8b2252;">"min"</span>: 2,
  <span style="color: #8b2252;">"max"</span>: 450,
  <span style="color: #8b2252;">"50th_percentile"</span>: 98,
  <span style="color: #8b2252;">"90th_percentile"</span>: 129,
  <span style="color: #8b2252;">"95th_percentile"</span>: 432,
  <span style="color: #8b2252;">"99th_percentile"</span>: 444
},
<span style="color: #8b2252;">"start_time_delay"</span>: {
  <span style="color: #8b2252;">"name"</span>: <span style="color: #8b2252;">"Start Time Delay"</span>,
  <span style="color: #8b2252;">"unit"</span>: <span style="color: #8b2252;">"MILLISECONDS"</span>,
  <span style="color: #8b2252;">"count"</span>: 7,
  <span style="color: #8b2252;">"mean"</span>: 3.5714285714285716,
  <span style="color: #8b2252;">"min"</span>: 0,
  <span style="color: #8b2252;">"max"</span>: 25,
  <span style="color: #8b2252;">"50th_percentile"</span>: 0,
  <span style="color: #8b2252;">"90th_percentile"</span>: 0,
  <span style="color: #8b2252;">"95th_percentile"</span>: 25,
  <span style="color: #8b2252;">"99th_percentile"</span>: 25
},
<span style="color: #8b2252;">"result_code"</span>: {
  <span style="color: #8b2252;">"name"</span>: <span style="color: #8b2252;">"Result Code"</span>,
  <span style="color: #8b2252;">"unit"</span>: <span style="color: #8b2252;">"Result Code"</span>,
  <span style="color: #8b2252;">"count"</span>: 50,
  <span style="color: #8b2252;">"all_values"</span>: {
    <span style="color: #8b2252;">"0"</span>: 42,
    <span style="color: #8b2252;">"1"</span>: 8
  }
}
</pre>
</div>
<p>
It provides stats for 50 executions of Query1 along 3 measures:
</p>
<ul class="org-ul">
<li>Runtime: query execution time
</li>
<li>StartDelay: delay between scheduled and actual query start time.
</li>
<li>Result: result code
</li>
</ul>

<p>
Note: queries are scheduled by the driver using these parameters:
</p>
<ul class="org-ul">
<li>LdbcQueryN_interleave: interval between successive executions of query N
</li>
<li>timeCompressionRatio: multiplier to compress/stretch all interleave times
</li>
<li>toleratedExecutionDelay: if start delay exceeds this, a timeout is recorded
</li>
</ul>

<p>
These measures are interesting, since:
</p>
<ul class="org-ul">
<li>We have 2 numeric measures (MilliSeconds) and 1 categorial (result code)
</li>
<li>The numeric measures provide a number of Summary Statistics
</li>
</ul>
</div>
