README.org
*** SNB Turtle
We represent this as the following Turtle.
- We populate the cube using 3 Slices, each having the same structure ~snb-stat:sliceByQueryAndMeasure~
- We model the Summary Statistics as Dimension (~bm-stat:dimStat~), and the unit-of-measure as Attribute (~bm-stat:attrUnit~)
- For the categorial measure ~snb-stat:measResult~ we model the individual categories (code values) as Attrbute (~bm-stat:attrResult~)
#+BEGIN_SRC Turtle
snb-run:sample1-cube a qb:DataSet;
  qb:structure snb-stat:dsdCube;
  qb:slice snb-run:sample1-sliceRuntime, snb-run:sample1-sliceStartDelay, snb-run:sample1-sliceResult.

snb-run:sample1-sliceRuntime a qb:Slice;
  qb:sliceStructure snb-stat:sliceByQueryAndMeasure;
  snb-stat:dimQuery snb:Query1;
  qb:measureType qb:measRuntime;
  qb:observation
    [ bm-stat:dimStat bm-stat:count;        bm-stat:measRuntime  50; bm-stat:attrUnit unit:Number      ],
    [ bm-stat:dimStat bm-stat:mean;         bm-stat:measRuntime 100; bm-stat:attrUnit unit:MilliSecond ],
    [ bm-stat:dimStat bm-stat:min;          bm-stat:measRuntime   2; bm-stat:attrUnit unit:MilliSecond ],
    [ bm-stat:dimStat bm-stat:max;          bm-stat:measRuntime 450; bm-stat:attrUnit unit:MilliSecond ],
    [ bm-stat:dimStat bm-stat:median;       bm-stat:measRuntime  98; bm-stat:attrUnit unit:MilliSecond ],
    [ bm-stat:dimStat bm-stat:percentile90; bm-stat:measRuntime 129; bm-stat:attrUnit unit:MilliSecond ],
    [ bm-stat:dimStat bm-stat:percentile95; bm-stat:measRuntime 432; bm-stat:attrUnit unit:MilliSecond ],
    [ bm-stat:dimStat bm-stat:percentile99; bm-stat:measRuntime 444; bm-stat:attrUnit unit:MilliSecond ].

snb-run:sample1-sliceStartDelay a qb:Slice;
  qb:sliceStructure snb-stat:sliceByQueryAndMeasure;
  snb-stat:dimQuery snb:Query1;
  qb:measureType snb-stat:measStartDelay;
  qb:observation
    [ bm-stat:dimStat bm-stat:count;        bm-stat:measStartDelay  7;    bm-stat:attrUnit unit:Number      ],
    [ bm-stat:dimStat bm-stat:mean;         bm-stat:measStartDelay  3.57; bm-stat:attrUnit unit:MilliSecond ],
    [ bm-stat:dimStat bm-stat:min;          bm-stat:measStartDelay  0;    bm-stat:attrUnit unit:MilliSecond ],
    [ bm-stat:dimStat bm-stat:max;          bm-stat:measStartDelay 25;    bm-stat:attrUnit unit:MilliSecond ],
    [ bm-stat:dimStat bm-stat:median;       bm-stat:measStartDelay  0;    bm-stat:attrUnit unit:MilliSecond ],
    [ bm-stat:dimStat bm-stat:percentile90; bm-stat:measStartDelay  0;    bm-stat:attrUnit unit:MilliSecond ],
    [ bm-stat:dimStat bm-stat:percentile95; bm-stat:measStartDelay 25;    bm-stat:attrUnit unit:MilliSecond ],
    [ bm-stat:dimStat bm-stat:percentile99; bm-stat:measStartDelay 25;    bm-stat:attrUnit unit:MilliSecond ].

snb-run:sample1-sliceResult a qb:Slice;
  qb:sliceStructure snb-stat:sliceByQueryAndMeasure;
  snb-stat:dimQuery snb:Query1;
  qb:measureType snb-stat:measResult;
  qb:observation
    [ bm-stat:dimStat bm-stat:count; bm-stat:measResult 50;  bm-stat:attrResult snb-stat:result-total ],
    [ bm-stat:dimStat bm-stat:count; bm-stat:measResult 42;  bm-stat:attrResult snb-stat:result-0 ],
    [ bm-stat:dimStat bm-stat:count; bm-stat:measResult  8;  bm-stat:attrResult snb-stat:result-1 ].
#+END_SRC
I hope this representation fairly obviously corresponds to the JSON. *Please comment*.

Possible extensions:
- More dimensions, see [[Benchmark Result Dimensions]]
- May need some hierarchical dimension logic to capture the relation between Query Mix and individual Queries

Converting from JSON to Turtle should not be hard.
We might even be able to convert automatically by using a JSONLD Context, but I have not tried it.

