README.html

<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> SNB Turtle</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
We represent this as the following Turtle.
</p>
<ul class="org-ul">
<li>We populate the cube using 3 Slices, each having the same structure <code>snb-stat:sliceByQueryAndMeasure</code>
</li>
<li>We model the Summary Statistics as Dimension (<code>bm-stat:dimStat</code>), and the unit-of-measure as Attribute (<code>bm-stat:attrUnit</code>)
</li>
<li>For the categorial measure <code>snb-stat:measResult</code> we model the individual categories (code values) as Attrbute (<code>bm-stat:attrResult</code>)
</li>
</ul>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">snb-run:</span><span style="color: #008b8b;">sample1-cube</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">DataSet</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">structure</span> <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">dsdCube</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">slice</span> <span style="color: #228b22;">snb-run:</span><span style="color: #008b8b;">sample1-sliceRuntime,</span> <span style="color: #228b22;">snb-run:</span><span style="color: #008b8b;">sample1-sliceStartDelay,</span> <span style="color: #228b22;">snb-run:</span><span style="color: #008b8b;">sample1-sliceResult</span><span style="color: #228b22;">.</span>

<span style="color: #228b22;">snb-run:</span><span style="color: #008b8b;">sample1-sliceRuntime</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">Slice</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">sliceStructure</span> <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">sliceByQueryAndMeasure</span>;
  <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">dimQuery</span> <span style="color: #228b22;">snb:</span><span style="color: #008b8b;">Query1</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">measureType</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">measRuntime</span>;
  <span style="color: #228b22;">qb:</span>observation
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">count</span>;        <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measRuntime</span>  50; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">Number</span>      ],
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">mean</span>;         <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measRuntime</span> 100; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span> ],
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">min</span>;          <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measRuntime</span>   2; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span> ],
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">max</span>;          <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measRuntime</span> 450; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span> ],
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">median</span>;       <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measRuntime</span>  98; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span> ],
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">percentile90</span>; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measRuntime</span> 129; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span> ],
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">percentile95</span>; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measRuntime</span> 432; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span> ],
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">percentile99</span>; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measRuntime</span> 444; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span> <span style="color: #228b22;">].</span>

<span style="color: #228b22;">snb-run:</span><span style="color: #008b8b;">sample1-sliceStartDelay</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">Slice</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">sliceStructure</span> <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">sliceByQueryAndMeasure</span>;
  <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">dimQuery</span> <span style="color: #228b22;">snb:</span><span style="color: #008b8b;">Query1</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">measureType</span> <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">measStartDelay</span>;
  <span style="color: #228b22;">qb:</span>observation
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">count</span>;        <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measStartDelay</span>  7;    <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">Number</span>      ],
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">mean</span>;         <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measStartDelay</span>  3.57; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span> ],
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">min</span>;          <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measStartDelay</span>  0;    <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span> ],
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">max</span>;          <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measStartDelay</span> 25;    <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span> ],
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">median</span>;       <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measStartDelay</span>  0;    <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span> ],
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">percentile90</span>; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measStartDelay</span>  0;    <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span> ],
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">percentile95</span>; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measStartDelay</span> 25;    <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span> ],
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">percentile99</span>; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measStartDelay</span> 25;    <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond</span> <span style="color: #228b22;">].</span>

<span style="color: #228b22;">snb-run:</span><span style="color: #008b8b;">sample1-sliceResult</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">Slice</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">sliceStructure</span> <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">sliceByQueryAndMeasure</span>;
  <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">dimQuery</span> <span style="color: #228b22;">snb:</span><span style="color: #008b8b;">Query1</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">measureType</span> <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">measResult</span>;
  <span style="color: #228b22;">qb:</span>observation
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">count</span>; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measResult</span> 50;  <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrResult</span> <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">result-total</span> ],
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">count</span>; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measResult</span> 42;  <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrResult</span> <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">result-0</span> ],
    [ <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">count</span>; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measResult</span>  8;  <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrResult</span> <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">result-1</span> ].
</pre>
</div>
<p>
I hope this representation fairly obviously corresponds to the JSON. <b>Please comment</b>.
</p>

<p>
Possible extensions:
</p>
<ul class="org-ul">
<li>More dimensions, see <a href="#sec-3-2-8">3.2.8</a>
</li>
<li>May need some hierarchical dimension logic to capture the relation between Query Mix and individual Queries
</li>
</ul>

<p>
Converting from JSON to Turtle should not be hard.
We might even be able to convert automatically by using a JSONLD Context, but I have not tried it.
</p>
</div>
</div>
