README.org
*** SNB Header
The JSON also has a small "Header":
#+BEGIN_SRC js
  "unit": "MILLISECONDS",
  "start_time": 1400750662691,
  "finish_time": 1400750667691,
  "total_duration": 5000,
  "total_count": 50,
#+END_SRC

I thought about representing this as a small cube, but decided it's overkill.
So I hacked something using duct tape from various vocabularies (PROV, DCT, RDF).
Actually there is some thought invested in here:
- PROV will be used significantly to describe Runs: who, when, what entities were used (eg benchmark definition, SUT, etc)
- The general pattern "propName-value-unit" will be used throughout, eg for hardware features, benchmark parameters, etc
#+BEGIN_SRC Turtle
snb-run:sample1 a bm:Run;
  prov:startedAtTime [rdf:value 1400750662691; qudt:unit unit:MilliSecond];
  prov:endedAtTime   [rdf:value 1400750667691; qudt:unit unit:MilliSecond];
  dct:extent         [rdf:value 5000;          qudt:unit unit:MilliSecond];
  dct:extent         [rdf:value 50;            qudt:unit unit:Number];
  # TODO: describe benchmark, driver, system under test, etc
  bm-stat:dataset snb-run:sample1-cube.
#+END_SRC
Notes:
- The most important property is the link ~bm-stat:dataset snb-run:sample1-cube~ to the cube.
- The Run needs a lot more contextual links (see "PROV" above)
- Using dct:extent twice for such varied things like Duration and Count may seem weird,
  but it matches its definition "size or duration of the resource", and Unit distinguishes between the two.

*** SNB SPARQL
To make some charts, we need to extract data with SPARQL. Given a Run, say we want to extract:
- Each Runtime observation
- Each Query, which will be the series. Assume snb:Query has sortable ~dc:identifier~ (eg 1 or "Q001")
- Mean, min, max to plot "line with error bars"
- A "query fulfillment ratio" being "Query runtime count" divided by "Run total count"
Since Cube Normalization has brought all values down to each Observation, this is easy.
Since there are no nulls, we don't need OPTIONALs, so it's also fast.
We assume that the SPARQL variable ~$Run~ is instantiated (i.e. it's a SPARQL parameter)
#+BEGIN_SRC SPARQL
select ?query ?mean ?min ?max ?fulfillmentRatio {
  $Run bm-stat:dataSet ?dataset;
       dct:extent [rdf:value ?runCount; qudt:unit unit:Number].
  ?obs qb:dataSet ?dataset; qb:measureType qb:measRuntime;
       snb-stat:dimQuery [dc:identifier ?query].
  {?obs bm-stat:dimStat bm-stat:count; bm-stat:measRuntime ?count.
      bind(?count / ?runCount as ?fulfillmentRatio)} union
  {?obs bm-stat:dimStat bm-stat:mean;  bm-stat:measRuntime ?mean} union
  {?obs bm-stat:dimStat bm-stat:min;   bm-stat:measRuntime ?min} union
  {?obs bm-stat:dimStat bm-stat:max;   bm-stat:measRuntime ?max}
} order by ?query
#+END_SRC
- Note: op:numeric-divide() is xsd:decimal if both operands are xsd:integer, so we don't need to coerce to decimal
- TODO: check how the UNION behaves
