README.html

<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> SNB Header</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
The JSON also has a small "Header":
</p>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #8b2252;">"unit"</span>: <span style="color: #8b2252;">"MILLISECONDS"</span>,
<span style="color: #8b2252;">"start_time"</span>: 1400750662691,
<span style="color: #8b2252;">"finish_time"</span>: 1400750667691,
<span style="color: #8b2252;">"total_duration"</span>: 5000,
<span style="color: #8b2252;">"total_count"</span>: 50,
</pre>
</div>

<p>
I thought about representing this as a small cube, but decided it's overkill.
So I hacked something using duct tape from various vocabularies (PROV, DCT, RDF).
Actually there is some thought invested in here:
</p>
<ul class="org-ul">
<li>PROV will be used significantly to describe Runs: who, when, what entities were used (eg benchmark definition, SUT, etc)
</li>
<li>The general pattern "propName-value-unit" will be used throughout, eg for hardware features, benchmark parameters, etc
</li>
</ul>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">snb-run:</span><span style="color: #008b8b;">sample1</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">bm:</span><span style="color: #008b8b;">Run</span>;
  <span style="color: #228b22;">prov:</span><span style="color: #008b8b;">startedAtTime</span> <span style="color: #228b22;">[rdf:</span><span style="color: #008b8b;">value</span> 1400750662691; <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">unit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond]</span>;
  <span style="color: #228b22;">prov:</span><span style="color: #008b8b;">endedAtTime</span>   <span style="color: #228b22;">[rdf:</span><span style="color: #008b8b;">value</span> 1400750667691; <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">unit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond]</span>;
  <span style="color: #228b22;">dct:</span><span style="color: #008b8b;">extent</span>         <span style="color: #228b22;">[rdf:</span><span style="color: #008b8b;">value</span> 5000;          <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">unit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">MilliSecond]</span>;
  <span style="color: #228b22;">dct:</span><span style="color: #008b8b;">extent</span>         <span style="color: #228b22;">[rdf:</span><span style="color: #008b8b;">value</span> 50;            <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">unit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">Number]</span>;
  <span style="color: #b22222;"># TODO: describe benchmark, driver, system under test, etc</span>
  <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dataset</span> <span style="color: #228b22;">snb-run:</span><span style="color: #008b8b;">sample1-cube</span>.
</pre>
</div>
<p>
Notes:
</p>
<ul class="org-ul">
<li>The most important property is the link <code>bm-stat:dataset snb-run:sample1-cube</code> to the cube.
</li>
<li>The Run needs a lot more contextual links (see "PROV" above)
</li>
<li>Using dct:extent twice for such varied things like Duration and Count may seem weird,
but it matches its definition "size or duration of the resource", and Unit distinguishes between the two.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-3-3" class="outline-4">
<h4 id="sec-3-3-3"><span class="section-number-4">3.3.3</span> SNB SPARQL</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
To make some charts, we need to extract data with SPARQL. Given a Run, say we want to extract:
</p>
<ul class="org-ul">
<li>Each Runtime observation
</li>
<li>Each Query, which will be the series. Assume snb:Query has sortable <code>dc:identifier</code> (eg 1 or "Q001")
</li>
<li>Mean, min, max to plot "line with error bars"
</li>
<li>A "query fulfillment ratio" being "Query runtime count" divided by "Run total count"
</li>
</ul>
<p>
Since Cube Normalization has brought all values down to each Observation, this is easy.
Since there are no nulls, we don't need OPTIONALs, so it's also fast.
We assume that the SPARQL variable <code>$Run</code> is instantiated (i.e. it's a SPARQL parameter)
</p>
<div class="org-src-container">

<pre class="src src-SPARQL">select ?query ?mean ?min ?max ?fulfillmentRatio {
  $Run <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dataSet</span> ?dataset;
       <span style="color: #228b22;">dct:</span><span style="color: #008b8b;">extent</span> <span style="color: #228b22;">[rdf:</span><span style="color: #008b8b;">value</span> ?runCount; <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">unit</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">Number]</span>.
  ?obs <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">dataSet</span> ?dataset; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">measureType</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">measRuntime</span>;
       <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">dimQuery</span> <span style="color: #228b22;">[dc:</span><span style="color: #008b8b;">identifier</span> ?query].
  {?obs <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">count</span>; <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measRuntime</span> ?count.
      bind(?count / ?runCount as ?fulfillmentRatio)} union
  {?obs <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">mean</span>;  <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measRuntime</span> ?mean} union
  {?obs <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">min</span>;   <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measRuntime</span> ?min} union
  {?obs <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">max</span>;   <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measRuntime</span> ?max}
} order by ?query
</pre>
</div>
<ul class="org-ul">
<li>Note: op:numeric-divide() is xsd:decimal if both operands are xsd:integer, so we don't need to coerce to decimal
</li>
<li>TODO: check how the UNION behaves
</li>
</ul>
</div>
</div>
