README.org
*** SNB Stat Ontology
[[./snb-stat.ttl]] is based on BM Stat [[BM%20Stat%20Ontology][BM Stat Ontology]], and includes some Stat things that are specific to SNB
(we could decide to move it into BM Stat to keep the benchmarks-specific ontology minimal).

First a more specific Dimension that inherits all fields from ~bm-stat:dimQuery~ but fixes the range to ~snb:Query~. 
This allows checking that the right query is used in SNB cubes, but that's little gain. 
We can do without this property.
#+BEGIN_SRC Turtle
snb-stat:dimQuery a rdf:Property, qb:DimensionProperty;
  rdfs:label "query"@en;
  rdfs:comment "Query being measured"@en;
  rdfs:subPropertyOf bm-stat:dimQuery;
  rdfs:range snb:Query;
  qb:concept bm-stat:conceptQuery.
#+END_SRC

Then a Measure for the SNB-specific concept of "start time delay":
#+BEGIN_SRC Turtle
snb-stat:measStartDelay a rdf:Property, qb:MeasureProperty;
  rdfs:label "start delay"@en;
  rdfs:comment "Delay from scheduled time to actual execution time"@en;
  rdfs:range xsd:decimal.
#+END_SRC

Then we define a concept of "Result (code)", and an Attribute and Dimension using that concept. 
You can see how the Attribute and Dimension are tied together through the concept.
The Attribute is categorial (a qb:CodedProperty) while the Measure is numeric (integer).
#+BEGIN_SRC Turtle
snb-stat:attrResult a rdf:Property, qb:AttributeProperty, qb:CodedProperty;
  rdfs:label "result code"@en;
  rdfs:comment "Result being counted"@en;
  rdfs:range snb-stat:Result;
  qb:concept bm-stat:conceptResult;
  qb:codeList snb-stat:result.

snb-stat:measResult a rdf:Property, qb:MeasureProperty;
  rdfs:label "result count"@en;
  rdfs:comment "Count of results"@en;
  qb:concept bm-stat:conceptResult;
  rdfs:range xsd:integer.
#+END_SRC
We also define a codeList and code values (concepts) like ~snb-stat:result-1~ (not interesting).

Now we define a [[http://www.w3.org/TR/vocab-data-cube/#dsd-dsd][DataStructureDefinition]] for the cube. 
We use [[http://www.w3.org/TR/vocab-data-cube/#h4_dsd-mm-dim][Measure dimension]] ~qb:measureType~ because we got heterogenous observations: 
the 3 Measures are *not* uniformly populated throughout the cube.
#+BEGIN_SRC Turtle
snb-stat:dsdCube a qb:DataStructureDefinition;
  qb:component 
    [ qb:dimension snb-stat:dimQuery; qb:componentAttachment qb:Slice ],
    [ qb:dimension qb:measureType; qb:componentAttachment qb:Slice ],
    [ qb:dimension bm-stat:dimStat ], # mean, min, max, etc
    [ qb:attribute bm-stat:attrUnit ], # applicable for measRuntime and measStartDelay
    [ qb:attribute bm-stat:attrResult ], # applicable for measResult
    [ qb:measure   bm-stat:measRuntime ],
    [ qb:measure   snb-stat:measStartDelay ],
    [ qb:measure   snb-stat:measResult ];
  qb:sliceKey snb-stat:sliceByQueryAndMeasure.
#+END_SRC

Finally we define a slice structure. In each slice instance, ~snb-stat:dimQuery and ~qb:measureType~ must be fixed.
#+BEGIN_SRC Turtle
snb-stat:sliceByQueryAndMeasure a qb:SliceKey;
  rdfs:label "slice by query and measure"@en;
  rdfs:comment "Fix dimensions dimQuery and measureType"@en;
  qb:componentProperty snb-stat:dimQuery, qb:measureType.
#+END_SRC
Please look at [[SNB Turtle]] and check how this structure is used by the cube and slice instances.

*** TODO SNB FDR
Map c:/my/Onto/proj/LDBC/benchmarks/snb_full_disclosure/full_disclosure.txt
