README.html
<div id="outline-container-sec-3-3-4" class="outline-4">
<h4 id="sec-3-3-4"><span class="section-number-4">3.3.4</span> SNB Stat Ontology</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
<a href="./snb-stat.ttl">./snb-stat.ttl</a> is based on BM Stat <i>BM Stat Ontology</i>, and includes some Stat things that are specific to SNB
(we could decide to move it into BM Stat to keep the benchmarks-specific ontology minimal).
</p>

<p>
First a more specific Dimension that inherits all fields from <code>bm-stat:dimQuery</code> but fixes the range to <code>snb:Query</code>. 
This allows checking that the right query is used in SNB cubes, but that's little gain. 
We can do without this property.
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">dimQuery</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">rdf:</span><span style="color: #008b8b;">Property,</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">DimensionProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"query"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Query being measured"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">subPropertyOf</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimQuery</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span> <span style="color: #228b22;">snb:</span><span style="color: #008b8b;">Query</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">conceptQuery</span>.
</pre>
</div>

<p>
Then a Measure for the SNB-specific concept of "start time delay":
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">measStartDelay</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">rdf:</span><span style="color: #008b8b;">Property,</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"start delay"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Delay from scheduled time to actual execution time"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span> <span style="color: #228b22;">xsd:</span><span style="color: #008b8b;">decimal</span>.
</pre>
</div>

<p>
Then we define a concept of "Result (code)", and an Attribute and Dimension using that concept. 
You can see how the Attribute and Dimension are tied together through the concept.
The Attribute is categorial (a qb:CodedProperty) while the Measure is numeric (integer).
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">attrResult</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">rdf:</span><span style="color: #008b8b;">Property,</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">AttributeProperty,</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">CodedProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"result code"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Result being counted"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span> <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">Result</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">conceptResult</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">codeList</span> <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">result</span><span style="color: #228b22;">.</span>

<span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">measResult</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">rdf:</span><span style="color: #008b8b;">Property,</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"result count"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Count of results"</span>@en;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">conceptResult</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span> <span style="color: #228b22;">xsd:</span><span style="color: #008b8b;">integer</span>.
</pre>
</div>
<p>
We also define a codeList and code values (concepts) like <code>snb-stat:result-1</code> (not interesting).
</p>

<p>
Now we define a <a href="http://www.w3.org/TR/vocab-data-cube/#dsd-dsd">DataStructureDefinition</a> for the cube. 
We use <a href="http://www.w3.org/TR/vocab-data-cube/#h4_dsd-mm-dim">Measure dimension</a> <code>qb:measureType</code> because we got heterogenous observations: 
the 3 Measures are <b>not</b> uniformly populated throughout the cube.
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">dsdCube</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">DataStructureDefinition</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">component</span> 
    [ <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">dimQuery</span>; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">Slice</span> ],
    [ <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">measureType</span>; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">Slice</span> ],
    [ <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">dimStat</span> ], <span style="color: #b22222;"># mean, min, max, etc</span>
    [ <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrUnit</span> ], <span style="color: #b22222;"># applicable for measRuntime and measStartDelay</span>
    [ <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">attrResult</span> ], <span style="color: #b22222;"># applicable for measResult</span>
    [ <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bm-stat:</span><span style="color: #008b8b;">measRuntime</span> ],
    [ <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">measStartDelay</span> ],
    [ <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">measResult</span> ];
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">sliceKey</span> <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">sliceByQueryAndMeasure</span>.
</pre>
</div>

<p>
Finally we define a slice structure. In each slice instance, <code>snb-stat:dimQuery and ~qb:measureType</code> must be fixed.
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">sliceByQueryAndMeasure</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">SliceKey</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"slice by query and measure"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Fix dimensions dimQuery and measureType"</span>@en;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentProperty</span> <span style="color: #228b22;">snb-stat:</span><span style="color: #008b8b;">dimQuery,</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">measureType</span>.
</pre>
</div>
<p>
Please look at <a href="#sec-3-3-1">3.3.1</a> and check how this structure is used by the cube and slice instances.
</p>
</div>
</div>

<div id="outline-container-sec-3-3-5" class="outline-4">
<h4 id="sec-3-3-5"><span class="section-number-4">3.3.5</span> <span class="todo TODO">TODO</span> SNB FDR</h4>
<div class="outline-text-4" id="text-3-3-5">
<p>
Map c:/my/Onto/proj/LDBC/benchmarks/snb_full_disclosure/full_disclosure.txt
</p>
</div>
</div>
</div>
