README.org
** SPB Results
semantic_publishing_benchmark_results.log is a simple text format like this:
- It's cumulative, so you only need to look at the last block
- 960260 is the timestamp in MilliSeconds (with warmup), 900 is the timestamp in seconds (without warmup)
- Editorial are write threads (just 1); Aggregation are read threads (6 of them)
- Write threads execute 3 kinds of queries (insert, update, delete), read threads execute Q1..Q9
- Counts per update operation, per query; total updates and total queries
- "Completed query mixes" is just about equal to the minimum of counts per query (a mix is counted Completed if each query was executed once)
- Number of errors: total for update operations; per query for read operations
- Average, min, max MilliSeconds per operation (90, 90, 99 percentiles will also be added)
[[./spb-sample1.txt]]:
#+BEGIN_EXAMPLE
960260 : 

Seconds : 900 (completed query mixes : 296)
	Editorial:
		1 agents

		7082  inserts (avg : 85      ms, min : 50      ms, max : 1906    ms)
		903   updates (avg : 203     ms, min : 128     ms, max : 1894    ms)
		879   deletes (avg : 110     ms, min : 64      ms, max : 1397    ms)

		8864 operations (7082 CW Inserts (0 errors), 903 CW Updates (0 errors), 879 CW Deletions (0 errors))
		9.8489 average operations per second

	Aggregation:
		6 agents

		299   Q1   queries (avg : 2120    ms, min : 10      ms, max : 31622   ms, 0 errors)
		297   Q2   queries (avg : 13      ms, min : 10      ms, max : 108     ms, 0 errors)
		297   Q3   queries (avg : 3200    ms, min : 383     ms, max : 85870   ms, 0 errors)
		298   Q4   queries (avg : 694     ms, min : 100     ms, max : 7135    ms, 0 errors)
		300   Q5   queries (avg : 368     ms, min : 16      ms, max : 5622    ms, 0 errors)
		298   Q6   queries (avg : 303     ms, min : 37      ms, max : 10246   ms, 0 errors)
		297   Q7   queries (avg : 1439    ms, min : 58      ms, max : 4995    ms, 0 errors)
		297   Q8   queries (avg : 531     ms, min : 80      ms, max : 2293    ms, 0 errors)
		298   Q9   queries (avg : 9184    ms, min : 509     ms, max : 37868   ms, 0 errors)

		2681 total retrieval queries (0 timed-out)
		3.0225 average queries per second
#+END_EXAMPLE
*** TODO SPB Turtle
** BM Stat Ontology
The BM Stat Ontology [[./bm-stat.ttl]] defines common stat concepts that can be used between different benchmarks:
- Common concepts, such as Run, Runtime, Query, Result (code)
- Summary Statistics codeList ~bm-stat:stat~, class ~bm-stat:Stat~ and code values, as shown in [[SDMX]]
- Commonly used dimensions, measures and attributes: ~bm-stat:dimQuery~, ~bm-stat:dimStat~, ~bm-stat:measRuntime~, ~bm-stat:attrUnit~.
  - These have appropriate ranges: (to be defined in subproperties), ~bm-stat:Stat~, ~xsd:decimal~, ~qudt:Unit~ respectively
