README.html
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> SPB Results</h3>
<div class="outline-text-3" id="text-3-4">
<p>
semantic_publishing_benchmark_results.log is a simple text format like this:
</p>
<ul class="org-ul">
<li>It's cumulative, so you only need to look at the last block
</li>
<li>960260 is the timestamp in MilliSeconds (with warmup), 900 is the timestamp in seconds (without warmup)
</li>
<li>Editorial are write threads (just 1); Aggregation are read threads (6 of them)
</li>
<li>Write threads execute 3 kinds of queries (insert, update, delete), read threads execute Q1..Q9
</li>
<li>Counts per update operation, per query; total updates and total queries
</li>
<li>"Completed query mixes" is just about equal to the minimum of counts per query (a mix is counted Completed if each query was executed once)
</li>
<li>Number of errors: total for update operations; per query for read operations
</li>
<li>Average, min, max MilliSeconds per operation (90, 90, 99 percentiles will also be added)
</li>
</ul>
<p>
<a href="./spb-sample1.txt">./spb-sample1.txt</a>:
</p>
<pre class="example">
960260 : 

Seconds : 900 (completed query mixes : 296)
	Editorial:
		1 agents

		7082  inserts (avg : 85      ms, min : 50      ms, max : 1906    ms)
		903   updates (avg : 203     ms, min : 128     ms, max : 1894    ms)
		879   deletes (avg : 110     ms, min : 64      ms, max : 1397    ms)

		8864 operations (7082 CW Inserts (0 errors), 903 CW Updates (0 errors), 879 CW Deletions (0 errors))
		9.8489 average operations per second

	Aggregation:
		6 agents

		299   Q1   queries (avg : 2120    ms, min : 10      ms, max : 31622   ms, 0 errors)
		297   Q2   queries (avg : 13      ms, min : 10      ms, max : 108     ms, 0 errors)
		297   Q3   queries (avg : 3200    ms, min : 383     ms, max : 85870   ms, 0 errors)
		298   Q4   queries (avg : 694     ms, min : 100     ms, max : 7135    ms, 0 errors)
		300   Q5   queries (avg : 368     ms, min : 16      ms, max : 5622    ms, 0 errors)
		298   Q6   queries (avg : 303     ms, min : 37      ms, max : 10246   ms, 0 errors)
		297   Q7   queries (avg : 1439    ms, min : 58      ms, max : 4995    ms, 0 errors)
		297   Q8   queries (avg : 531     ms, min : 80      ms, max : 2293    ms, 0 errors)
		298   Q9   queries (avg : 9184    ms, min : 509     ms, max : 37868   ms, 0 errors)

		2681 total retrieval queries (0 timed-out)
		3.0225 average queries per second
</pre>
</div>
<div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> <span class="todo TODO">TODO</span> SPB Turtle</h4>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> BM Stat Ontology</h3>
<div class="outline-text-3" id="text-3-5">
<p>
The BM Stat Ontology <a href="./bm-stat.ttl">./bm-stat.ttl</a> defines common stat concepts that can be used between different benchmarks:
</p>
<ul class="org-ul">
<li>Common concepts, such as Run, Runtime, Query, Result (code)
</li>
<li>Summary Statistics codeList <code>bm-stat:stat</code>, class <code>bm-stat:Stat</code> and code values, as shown in <a href="#sec-3-2-4">3.2.4</a>
</li>
<li>Commonly used dimensions, measures and attributes: <code>bm-stat:dimQuery</code>, <code>bm-stat:dimStat</code>, <code>bm-stat:measRuntime</code>, <code>bm-stat:attrUnit</code>.
<ul class="org-ul">
<li>These have appropriate ranges: (to be defined in subproperties), <code>bm-stat:Stat</code>, <code>xsd:decimal</code>, <code>qudt:Unit</code> respectively
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2015-02-02</p>
<p class="author">Author: Vladimir Alexiev, Ontotext Corp</p>
<p class="email">Email: <a href="mailto:vladimir.alexiev@ontotext.com">vladimir.alexiev@ontotext.com</a></p>
<p class="date">Created: 2015-02-02 Mon 15:48</p>
<p class="creator">Proudly made with: Emacs 24.3.91.1 (Org mode 8.2.7c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
